[
  {
    "id": "517b09ab-d600-4764-8a00-dc86ef66e2d4",
    "firstName": "Africa",
    "lastName": "Mincey",
    "fullName": "Africa Mincey",
    "bio": "Africa Mincey is an accessibility engineer and occupational therapist with a passion for making websites usable for people of all abilities. As an occupational therapist she helped individuals with acute injuries and disabilities increase independence with rehabilitative exercise and  assistive technology tools. She transitioned away from direct patient care to work as a Web developer building full stack web applications. She now specializes in analyzing and testing software for adherence to the digital accessibility laws covered under the Americans With Disabilities Act. ",
    "tagLine": "Accessibility Engineer ",
    "profilePicture": "https://sessionize.com/image/397e-400o400o2-V9tY5fb6UP7wd4N1Gg8BBQ.jpg",
    "sessions": [
      {
        "id": 432670,
        "name": "Intro to Web Accessibility for Web developers and Designers"
      }
    ],
    "isTopSpeaker": false,
    "links": [],
    "questionAnswers": [],
    "categories": []
  },
  {
    "id": "7ed5980b-4b5c-4732-b55e-a46a5140824d",
    "firstName": "Alaxandria",
    "lastName": "Foreman",
    "fullName": "Alaxandria Foreman",
    "bio": "Highly focused on transforming underserved communities into capital markets, Alaxandria works at the intersection of Community Development; Technology; and Venture Capital. Known as a super-connector and ecosystem builder, Alaxandria spends the majority of her time serving as a conduit for local Black and Brown founders and those interested in entering the Chicago market. Currently, she has her hands busy building online communities such as Goodie Nation and organizing culturally relevant tech opportunities for the South Side via Black Tech Migrants, a subsidiary brand of the ChiTechCLLCT.  ",
    "tagLine": "Co-Curator at Chicago Tech Collective ",
    "profilePicture": "https://sessionize.com/image/6916-400o400o2-T83tuGsLuTPkEaRKbb6EHS.jpg",
    "sessions": [
      {
        "id": 417107,
        "name": "Milieu: How higher education can transition underserved communities"
      }
    ],
    "isTopSpeaker": false,
    "links": [],
    "questionAnswers": [],
    "categories": []
  },
  {
    "id": "79c91139-e959-4a91-b85c-27f6dca1e36f",
    "firstName": "Anthony",
    "lastName": "Culver",
    "fullName": "Anthony Culver",
    "bio": "Anthony is a data engineer turned software engineer who loves working on backend platforms and nerding out about all things data. Currently working on the Growth Data Engineering team at Netflix, his previous experience includes time as a software engineer in Content Engineering at Netflix, as well as time at Mailchimp, Cerner, and Bank of America to name a few. Anthony holds Computer Science degrees from both the historic Clark Atlanta University, as well as DePaul University, and has further expanded his expertise with Kubernetes, Apache Cassandra, and Google Cloud Data Engineering certifications. Anthony is extremely passionate about mentoring and supporting those from underrepresented communities in tech and is always open to a coffee chat and meeting someone new. You can always find Anthony on various social platforms as @antculver.",
    "tagLine": "Senior Data Engineer @ Netflix",
    "profilePicture": "https://sessionize.com/image/62ff-400o400o2-PvPus5MYWhqpb4zHwsvAC6.jpg",
    "sessions": [
      {
        "id": 411130,
        "name": "Data Engineering Demystified"
      }
    ],
    "isTopSpeaker": false,
    "links": [],
    "questionAnswers": [],
    "categories": []
  },
  {
    "id": "a3e0e5a9-3980-4234-9fa2-fca935b3ba9f",
    "firstName": "Ashley",
    "lastName": "Janelle",
    "fullName": "Ashley Janelle",
    "bio": "\r\nAs a seasoned User Experience and User Interface Designer, Ashley Janelle focuses on designing customer centered experiences that target her users everyday challenges. At Amazon, Ashley taps into user needs while designing solutions that allow them to save time, money, and increase their productivity. \r\n\r\nAs a UX coach and course creator, she’s developed an online course, “Learn UX Online in 16 Weeks” to help aspiring UX designers go from beginner to experienced UX Designers to land jobs at top companies. Using her UX expertise and passion for working with people, Ashley’s not only helped others land their dream roles, but build the confidence to become successful UX Designers. ",
    "tagLine": "UX/UI Designer & UX Coach",
    "profilePicture": "https://sessionize.com/image/2041-400o400o2-wUTTt6HMuiKHFntGKazkb7.png",
    "sessions": [
      {
        "id": 427002,
        "name": "4 Steps to Becoming a UX/UI Designer"
      }
    ],
    "isTopSpeaker": false,
    "links": [],
    "questionAnswers": [],
    "categories": []
  },
  {
    "id": "252c2379-b93b-4109-a0d1-d96fae88f42e",
    "firstName": "Athena ",
    "lastName": "Sayaka",
    "fullName": "Athena Sayaka",
    "bio": "Athena marries neuroscience and spirituality to bring embodied yet practical insight to the stage. She is passionate about showing neurodivergent creators how to develop supportive practices that help them navigate uncertainty with confidence.\r\n\r\nAthena hosts the What Happens In Between podcast which highlights the unsexy middle bits of creating something meaningful.\r\n\r\nShe earned her degree from the Wharton School at University of Pennsylvania and utilizes a variety of modalities in her work. \r\n\r\nYou can learn more about Athena at athenasayaka.com !",
    "tagLine": "Speaker | Writer | Neurodivergent Mystic",
    "profilePicture": "https://sessionize.com/image/3b4b-400o400o2-7y2NfzRrQRPkq9Jei19yq5.jpg",
    "sessions": [
      {
        "id": 425399,
        "name": "How To Leverage Your Neurodivergence At Work"
      }
    ],
    "isTopSpeaker": false,
    "links": [],
    "questionAnswers": [],
    "categories": []
  },
  {
    "id": "35ef0809-19b6-400a-8e54-bed0feb41181",
    "firstName": "Brandi",
    "lastName": "Brown",
    "fullName": "Brandi Brown",
    "bio": "After a corporate hiatus dedicated to family and acting, Brandi re-entered the business world with a renewed purpose. Co-founder of Juneteenth Conference, she leverages her expertise in customer service, community engagement, and human resources to drive positive change. Brandi's unwavering focus is on Diversity, Equity, and Inclusion (DEI) in and beyond her workplace. She is dedicated to fostering an inclusive society.",
    "tagLine": "JuneteenthConf Cofounder and DEI Leader",
    "profilePicture": "https://sessionize.com/image/60b9-400o400o2-LjFLmuzNsidWX5DyguP14b.jpeg",
    "sessions": [
      {
        "id": 451027,
        "name": "Right Within: A Discussion with Minda Harts"
      }
    ],
    "isTopSpeaker": false,
    "links": [],
    "questionAnswers": [],
    "categories": []
  },
  {
    "id": "94283da5-46bf-42e4-91b4-6cd55adfe4a2",
    "firstName": "Dillon",
    "lastName": "White",
    "fullName": "Dillon White",
    "bio": "A Microsoft evangelist with over twelve years of IT roles. Military veteran with a background in Cloud Security and Virtualization. Now providing Architecture consulting and career transition coaching.  ",
    "tagLine": "Senior Microsoft Architect and Career Coach",
    "profilePicture": "https://sessionize.com/image/1b5e-400o400o2-9HhNyJAtEiTF8aEUFhrF5U.jpg",
    "sessions": [
      {
        "id": 428909,
        "name": "Breaking the Barrier to a Tech Career : Microsoft"
      }
    ],
    "isTopSpeaker": false,
    "links": [],
    "questionAnswers": [],
    "categories": []
  },
  {
    "id": "6f23fc3a-c488-4260-962b-871b76bf0d0e",
    "firstName": "Dolly",
    "lastName": "Desir",
    "fullName": "Dolly Desir",
    "bio": "Dolly is a Solutions Engineer at Datadog that specializes in Cloud services. Before transitioning into tech, Dolly was an Assistant Merchandiser at Bergdorf Goodman and after 10 years, challenged herself to move into a different career that will always keep her learning. When Dolly is not working, the Brooklyn native is likely traveling, gaming, or becoming better versed in beauty, fashion, health, fitness & so much more!",
    "tagLine": "Solutions Engineer",
    "profilePicture": "https://sessionize.com/image/65a8-400o400o2-4XHTvKSuaeA4MaaXAijbYE.jpg",
    "sessions": [
      {
        "id": 418351,
        "name": "From Zero to Monitored"
      }
    ],
    "isTopSpeaker": false,
    "links": [],
    "questionAnswers": [],
    "categories": []
  },
  {
    "id": "dfb5530e-9a05-472d-af55-b65a21c33960",
    "firstName": "Kedasha",
    "lastName": "Kerr",
    "fullName": "Kedasha Kerr",
    "bio": "Kedasha is a Developer Advocate at Github where she enjoys creating content to engage the developer community.👩🏽‍💻 Prior to her transition to the world of tech, she worked as a social worker in various government agencies and attended an intense coding bootcamp in 2019 to make her transition to software development. \r\n\r\nShe finds joy in helping others learn about the tech industry and creates technical content on Instagram & Tiktok for new and aspiring technologists at @itsthatladydev. She has spoken at conferences, online workshops and multiple podcasts about her experience as a software developer. \r\nWhen she's not creating content online, you can find her in the kitchen cooking up her favorite Jamaican dish. \r\n",
    "tagLine": "Developer Advocate",
    "profilePicture": "https://sessionize.com/image/657b-400o400o2-fJQbDSeUwKsXUY9pCijfAt.jpg",
    "sessions": [
      {
        "id": 412049,
        "name": "How to Build a GPT-3 App with Nextjs, React and GitHub Copilot"
      }
    ],
    "isTopSpeaker": false,
    "links": [],
    "questionAnswers": [],
    "categories": []
  },
  {
    "id": "8d59a335-2fb2-410d-ab68-9a054399db76",
    "firstName": "Minda",
    "lastName": "Harts",
    "fullName": "Minda Harts",
    "bio": "Minda Harts is the bestselling and award-winning author of The Memo: What Women of Color Need to Know to Secure a Seat at the Table as well as Right Within: How to Heal from Racial Trauma in the Workplace, and her first YA book, You Are More Than Magic. She is a highly sought-after speaker and thought-leader, frequently presenting on the topics of advancing women of color, leadership, diversity, and management at companies like Nike, Google, JP Morgan, Aspen Ideas Festival, Dreamforce, The Atlantic Festival, Forbes Inclusion in The Workplace, and DraftKings to name a few. Minda is an assistant professor of public service at NYU's Robert F. Wagner Graduate School of Public Service and the founder of The Memo LLC, a career development company. In 2020, Minda was named by LinkedIn as the #1 Top Voice for Equity in the Workplace. In 2022, She was named by Business Insider as one the the top 100 People Transforming Business. Additionally, Minda was chosen by Marie Claire Magazine in 2022 to participate in Power Trip, where the year’s Top Women Movers and Shakers participate in an all-expense paid trip to network with each other. She has a weekly career podcast for women of color, titled Secure the Seat.",
    "tagLine": "Workplace & Equity Consultant, Bestselling Author",
    "profilePicture": "https://sessionize.com/image/6bdc-400o400o2-frPFkcDGfiWuFUJfmRC5Qg.jpg",
    "sessions": [
      {
        "id": 451027,
        "name": "Right Within: A Discussion with Minda Harts"
      }
    ],
    "isTopSpeaker": false,
    "links": [],
    "questionAnswers": [],
    "categories": []
  },
  {
    "id": "5993951d-cd59-48b4-80b0-6f1c80e88de2",
    "firstName": "Tim",
    "lastName": "Banks",
    "fullName": "Tim Banks",
    "bio": "Tim’s tech career spans over 25 years through various sectors. Tim’s initial journey into tech started in avionics in the US Marine Corps and then into various government contracting roles. After moving to the private sector, Tim worked both in large corporate environments and in small startups, honing his skills in systems administration, automation, architecture, and operations for large cloud-based datastores.\r\nToday, Tim leverages his years in operations, DevOps, and Site Reliability Engineering to advise and consult with the open source and cloud computing communities in his current role. Tim is also a competitive Brazilian Jiu-Jitsu practitioner. He has won the American National and is the 5-time and current reigning Pan American Brazilian Jiu-Jitsu champion in his division.",
    "tagLine": "Lead Developer Advocate, Dell Technologies",
    "profilePicture": "https://sessionize.com/image/b89e-400o400o2-wM34d1SHRh3dYsDdigLoto.jpg",
    "sessions": [
      {
        "id": 461319,
        "name": "The Solace of You"
      }
    ],
    "isTopSpeaker": false,
    "links": [],
    "questionAnswers": [],
    "categories": []
  },
  {
    "id": "5e8c6f6c-8208-4a1b-aa95-9e10db77ae96",
    "firstName": "Wesley",
    "lastName": "Faulkner",
    "fullName": "Wesley Faulkner",
    "bio": "Wesley Faulkner is a first-generation American, public speaker, and podcaster. He is a founding member of the government transparency group Open Austin and a staunch supporter of racial justice, workplace equity, and neurodiversity. His professional experience spans technology from AMD, Atlassian, Dell, IBM, and MongoDB. Wesley co-hosts the developer relations focused podcast Community Pulse and serves on the board for SXSW.",
    "tagLine": "Developer Relations Professional",
    "profilePicture": "https://sessionize.com/image/7256-400o400o2-XxXY9NZJCzDpa1WnTwRXZk.jpg",
    "sessions": [
      {
        "id": 407869,
        "name": "Doing Due Diligence On Your Next Employer"
      }
    ],
    "isTopSpeaker": false,
    "links": [],
    "questionAnswers": [],
    "categories": []
  }
]
