{"sessions":null,"Days":[{"generic":{"eventStartsAt":"2020-06-19T16:00:00Z","eventEndsAt":"2020-06-19T22:00:00Z"},"track1":{"id":1,"title":"Track 1","talks":[{"id":"205778","title":"Keynote: From Frying Chicken To Software Engineer","description":"I spent 10 years working in gas stations, liquor stores and small retail. Never knew the path to tech was possible until a Rapper changed my life.<br/><br/>In this talk I will discuss my journey, going from frying chicken to helping 44 people land their first jobs in tech. To helping bring positive change to my city and to becoming a software engineer.","startsAt":"2020-06-19T16:00:00Z","endsAt":"2020-06-19T17:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":60,"speakers":[{"fullName":"Danny Thompson","bio":"https://dev.to/dthompsondev/from-frying-chicken-in-gas-stations-to-becoming-a-software-engineer-4ff4","tagLine":"Software Engineer, Meetup organizer and podcast host for \"Commit your code!\"","profilePicture":"https://sessionize.com/image?f=678281290f4aec93ca95a90a9c9942e2,400,400,1,0,d0-7999-4ca0-9ff5-e55622409a8e.ec1f102f-7be4-4e4a-83ac-494a5f5d74d3.jpeg","twitter":null,"id":"179430d0-7999-4ca0-9ff5-e55622409a8e"}],"multipleSpeakers":false},{"id":"205452","title":"Combatting Bias in Machine Learning","description":"In this talk I cover how to see the bias in your data and machine learning models. By giving examples from recent research on biased facial recognition systems as well as cutting edge explainability algorithms, attendees can expect clarification on what bias means in machine learning.","startsAt":"2020-06-19T17:00:00Z","endsAt":"2020-06-19T17:30:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Ayodele Odubela","bio":"Ayodele Odubela is a Data Scientist working on driver risk mitigation at SambaSafety in Denver, CO. Previously she earned her Master's degree in Data Science after transitioning to tech from social media marketing. She's created algorithms that predict consumer segment movement, goals in hockey, and the location of firearms using radio frequency sensors. ","tagLine":"Data Scientist at SambaSafety","profilePicture":"https://sessionize.com/image?f=bb5c451a1ca33549ff77eb81c90601d6,400,400,1,0,a7-e484-40e8-8e70-f62435aca9fd.0ea2f563-04c6-476a-9f79-5a5e4a8ef681.png","twitter":"http://www.twitter.com/ayodeleohh","id":"2a59bea7-e484-40e8-8e70-f62435aca9fd"}],"multipleSpeakers":false},{"id":"205477","title":"Empowered by Imposter Syndrome","description":"Imposter syndrome is something that the industry continues to represent as a negative. My take on this as a black woman in tech is we need to turn all of our disadvantages into growth opportunities. Adding structure to our learning path is the best way of removing the negative image of feeling like an imposter and allows us to flourish.","startsAt":"2020-06-19T17:30:00Z","endsAt":"2020-06-19T18:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Valerie Phoenix","bio":"Valerie Phoenix is a Founder & CEO at Tech By Choice and a Senior Software Engineer at Mastery Logistics. She holds a BS in Psychology & Art. Valerie is passionate about creating secure human-centered digital experiences. As a successful self-taught developer, Valerie started Tech By Choice to give back to the community that helped her succeed.","tagLine":"Founder & CEO of Tech By Choice","profilePicture":"https://sessionize.com/image?f=276d3a17da31dcf9de997d0ccd065536,400,400,1,0,c9-b6b5-42a6-a6e5-18b825681c3f.e07dbb3f-aa4a-41db-99a2-fd43d0efd5c9.jpg","twitter":null,"id":"71fee9c9-b6b5-42a6-a6e5-18b825681c3f"}],"multipleSpeakers":false},{"id":"205543","title":"Empowerment to the People!  What You Need to Know about Black People, Disability, and Accessibility","description":"About one fifth (20%) of the global population lives with disabilities.​ According to the 2017 American Community Survey, 13.6 percent of Black and African Americans have a disability. Further, the unemployment rate for people with disabilities is almost double of other people, and the people with disabilities who are employed have lower earnings, in general.<br/><br/>This means we have an opportunity and a duty to empower Black people with technology. One of the most powerful ways we can do this is to make our messaging and technology accessible.<br/><br/>While many of us have heard that accessibility is important, we seldom hear about how to implement it in our everyday work. Angela will discuss how people in every discipline can do so and further amplify the voices of Black people.","startsAt":"2020-06-19T18:00:00Z","endsAt":"2020-06-19T19:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":60,"speakers":[{"fullName":"Angela Hooker","bio":"Angela Hooker is a Senior Accessibility Program Manager at Microsoft, where she's built a center of expertise for accessibility, user experience, and universal design. She's brought her web management, development, design, accessibility, and editorial and content management expertise to the government and private sector for over 20 years.<br/><br/>Angela also advocates for role-based accessibility and believes that teaching people how to incorporate principles of accessibility in their everyday work creates a sustainable program and produces the most accessible user experiences. Angela speaks on and writes about accessibility, disability, user experience, and plain language.","tagLine":"@AccessForAll","profilePicture":"https://sessionize.com/image?f=66a51c304fa627683949a420c62f8434,400,400,1,0,26-aa6c-4e2e-96c8-2ecfa8c07a99.05defb29-d279-48fe-a0ca-47140b0d3e1c.jpg","twitter":null,"id":"f2f7fe26-aa6c-4e2e-96c8-2ecfa8c07a99"}],"multipleSpeakers":false},{"id":"205425","title":"Black Queer Living: a history of DIY culture in the Black LBGT+ community","description":"What is DIY culture? How does DIY culture intertwine with the Black LGBT+ culture? Get these questions answered, and learn a few easy beginner DIY tutorials to do on t-shirts! No previous experience required!","startsAt":"2020-06-19T19:00:00Z","endsAt":"2020-06-19T20:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":60,"speakers":[{"fullName":"Harold Jackson N/A","bio":"Harold studied computer science at the University of Texas at Austin. He's started Black Queer Living, a youtube channel dedicated to teaching life skills 101, centering queer and trans* people of color: https://www.youtube.com/channel/UCx3ihWKRcPrTDdhk87M2yeg","tagLine":"Bandana Montana","profilePicture":"https://sessionize.com/image?f=c0abbcd5b636ace581c6a672b961736b,400,400,1,0,69-bc29-4570-824e-31ed1601338e.3cf61c49-4630-412c-a5ef-4cf8095f3593.jpg","twitter":null,"id":"7e8f2669-bc29-4570-824e-31ed1601338e"}],"multipleSpeakers":false},{"id":"205460","title":"Journaling as a Dev","description":"Are you working with impact and purpose? Are you solidly attuned on what you're doing month-to-month with your role? How difficult is it for you to track your accomplishments at work? If any of these questions lead to uncertain answers, then you should learn what it means to journal professionally as a dev. This talk will cover my exploration into journaling and its application to tracking my goals and progress as a software engineer. I will discuss how to set up your journal for any goals and how to score on your performance review!","startsAt":"2020-06-19T20:00:00Z","endsAt":"2020-06-19T20:30:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Brittney Braxton","bio":"Brittney is a software engineer who loves a good cup of tea. In her spare time, she draws illustrations for teaNotes.dev on Instagram. Brittney strives to connect with folks who geek out over code with hopes to contribute to a friendly and inviting tech community.","tagLine":"Software Engineer ","profilePicture":"https://sessionize.com/image?f=f251e2b3e22564e038984f82ae042ebb,400,400,1,0,66-4f67-4eeb-b00b-816f3b5821e7.15a28eab-ec6e-4921-88fa-dba2621b28e5.jpeg","twitter":null,"id":"98b26966-4f67-4eeb-b00b-816f3b5821e7"}],"multipleSpeakers":false},{"id":"205428","title":"Your next open source contribution","description":"Today Open Source is ubiquitous and comprises nearly 80% – 90% of the code in a “typical” application. There is a need to use Open Source to stay competitive, but what about the need to use open source to advance your career?<br/><br/>In this talk, I will talk through actionable ways to make open-source contributions to grow your career.","startsAt":"2020-06-19T20:30:00Z","endsAt":"2020-06-19T21:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Brian Douglas","bio":"Brian Douglas is a Developer Advocate at GitHub where he works on increasing use of the GitHub API by iterating on the onboarding process and helping users with evergreen technical content.","tagLine":"GitHub Developer Advocate","profilePicture":"https://sessionize.com/image?f=a20f286b686099b2c552beb6055edd7c,400,400,1,0,54-dbbd-41e5-836c-b29535310588.02e77212-3703-4e8c-90af-f55c232dc4e2.jpg","twitter":"https://twitter.com/bdougieyo","id":"7fb55a54-dbbd-41e5-836c-b29535310588"}],"multipleSpeakers":false},{"id":"205801","title":"Keynote: The Journey To Inclusive Innovation Incubator (In3DC)","description":"How we ended up building an innovation space for black and underrepresented communities.  Our focus on tech enabled startups and small business is driven by our roots in the development firm Clearly Innovative Inc, mobile partners for NMAAHC","startsAt":"2020-06-19T21:00:00Z","endsAt":"2020-06-19T22:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":60,"speakers":[{"fullName":"Aaron Saunders","bio":"Aaron Saunders CEO Inclusive Innovation Incubator, Clearly Innovative, 30 years in technology /entrepreneurship space as developer, manager, founder and CEO","tagLine":"Aaron Saunders CEO Inclusive Innovation Incubator","profilePicture":"https://sessionize.com/image?f=5a2afb0408a6d1144406ea523525e2fe,400,400,1,0,ca-9ff3-48e9-8684-2604fa73c86e.91bfc673-1ad4-4639-bb9c-e28b637ecc8c.jpg","twitter":null,"id":"1f0457ca-9ff3-48e9-8684-2604fa73c86e"}],"multipleSpeakers":false}]},"track2":{"id":2,"title":"Track 2","talks":[{"id":"cecf8afe-7439-4b42-9055-f5f15f69df81","title":"Break","description":"Generated break","startsAt":"2020-06-19T16:00:00Z","endsAt":"2020-06-19T17:00:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":true,"duration":60,"speakers":[],"multipleSpeakers":false},{"id":"205366","title":"The Ideal Community Model: Lessons Learned","description":"There are many ways to push your career to a point it takes a great turn, but I found out in 2017 that community participation is a must. Community involvement can be anything from Open Source Contributions, Writing articles, answering questions on social media/StackOverflow to speaking at conferences. Participation in your community will expand your network. <br/><br/>By attending small meetups or having conversations in slack channels will lead you to meet new people in your industry. Sharing will increase your visibility in the ecosystem by Founders, people of related skill sets, recruiters, and more. <br/><br/>There isn’t just one way to share your expertise with your community. Open Source Contributions isn't just code, you can write articles/documentation about the product you would like to contribute to about your experiences or speak at conferences. Collaboration helps you to be seen as a leader in your community. You can collaborate with others in your network by mentoring, organizing an event, or working together on a personal project/ideas<br/><br/>I learned most of the things I know today about the community the hard way because I never saw it as anything important, and all I cared about was just write the code and today I am a Senior Developer Advocate at Fleek,  and also the lead organizer of some major communities in Africa which included, unStack, Developers Circles Lagos from Facebook, Open Source Community Africa, NaijaHacks, and AfricaHacks.<br/><br/>Key Takeaways:<br/><br/>1) Attendees will learn how to build a community on their own<br/>2) Attendees will learn how open-source works in a community<br/>3) Attendees will learn how to contribute to ideas to a community ","startsAt":"2020-06-19T17:00:00Z","endsAt":"2020-06-19T17:30:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Shodipo Ayomide","bio":"Shodipo Ayomide is a Developer Advocate, Engineer, and Occasional Designer, who also contributes to a lot of open-source projects over on GitHub, he also runs some major communities like unStack, Developers Circles Lagos from Facebook, Open Source Community Africa and NaijaHacks driving Nigeria & Africa forward in Technology, he is an international speaker who has spoken at a lot of conferences over time in various locations, in his free time he loves to, Read, See a Movie and Occasionally play video games, Loves Travelling and Family.<br/>","tagLine":"Senior Developer Advocate at Fleek","profilePicture":"https://sessionize.com/image?f=620438df2143939ff9c4103d63952deb,400,400,1,0,18-b136-4f7e-9db8-32ffcdebfa26.4dd1567c-3ca5-4f41-a914-7f1c7bbacf8a.jpg","twitter":"http://www.twitter.com/developerayo","id":"999f5218-b136-4f7e-9db8-32ffcdebfa26"}],"multipleSpeakers":false},{"id":"205535","title":"Breaking into Tech: From the Trenches","description":"Bottom Line: Grit is required from historically underrepresented groups to change the demographic of Software Engineers and Developers. This talk will share my personal obstacles from a non-traditional career path (Veteran, women of color, mother and coding bootcamp graduate) to a Software Engineer.<br/><br/>The intent is to encourage passionate developers who are members of historically underrepresented groups, but not limited to new developers from non-tech industries, developers starting second careers, re-entering the workforce, and those who have attended coding bootcamps, to build and support a community in Open Source.","startsAt":"2020-06-19T17:30:00Z","endsAt":"2020-06-19T18:00:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Mo Hampton","bio":"Mo Hampton is a Software Engineer at GDIT. Her passion for web application development led her to the Open Source community to learn full-stack JavaScript. When not thriving off of coffee, meditation or travel, she builds cost-effective, user-friendly business applications.","tagLine":"Software Engineer @ General Dynamics IT","profilePicture":"https://sessionize.com/image?f=23c06d3c405fc2f4628267b8e688a458,400,400,1,0,2f-0e9e-4181-8a9d-bff10f1161a2.4dc3907d-d3f7-4f6c-be5b-45735f54d617.jpeg","twitter":null,"id":"cf6f0e2f-0e9e-4181-8a9d-bff10f1161a2"}],"multipleSpeakers":false},{"id":"205542","title":"Your Startup: How to Launch, Capitalize and Win - Against All Odds","description":"The startup world is no longer reserved for Silicon Valley, NYC or Austin Texas - to name a few popular locations. Startups have been increasingly launched in cities across the country. What is more interesting is the growing interest in incubating and funding minority-founded (and run) companies. According to the Brookings Institute analysis of the U.S. Census Bureau's Survey of Business Owners data, black-owned firms with paid employees have generated over $103 billion in revenue annually. Underinvestment in black-owned businesses results in fact that these new business owners find themselves in the position of being more cash-strapped than the average startup. This session, it's presentation and accompanying list of resources is aimed at providing a fundamental background on launching a startup company and how to attract talent, customers and capital investors. Even during the COVID-19 pandemic, business is still being conducted and investors are still performing due-diligence on companies with potential.<br/><br/><br/>","startsAt":"2020-06-19T18:00:00Z","endsAt":"2020-06-19T19:00:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":false,"duration":60,"speakers":[{"fullName":"Jeff Debrosse","bio":"Jeff Debrosse is a technology and cybersecurity industry veteran and is currently the founder and principal at Sympler where he runs the company's daily operations around designing and building core security architectures, contact-tracing solutions for COV!D-19 and robotics solutions. Prior to founding Sympler, Jeff was the Chief Technology Officer for Adaptive Motion Group where he led development on the navigation and security architectures of AMG’s autonomous systems. Jeff also founded and led NXT Robotics from 2014-2017. In his role as CEO, Jeff raised the company’s seed round of funding and as CTO he designed and built the security, vision, navigation and sensor integration frameworks. <br/><br/>Jeff also led the cybersecurity, R&D and product development teams at Websense (acquired by Vista Equity Partners), ESET LLC. and Ntrepid Corporation. He also worked on classified projects for the intelligence community where he created and deployed increasingly effective and sophisticated cybersecurity solutions across a broad spectrum of requirements. Jeff has spoken at leading conferences such as Gartner, RSA, BlackHat, defCon and other events across the globe. Jeff has a BS in IT Management and he is currently an adjunct faculty member of San Diego State University’s (SDSU) Homeland Security Program.  <br/>","tagLine":"Principal, Sympler LLC","profilePicture":"https://sessionize.com/image?f=827a2cafdf02a14ed94f413d35635472,400,400,1,0,38-15e3-4791-bb45-def422b9d0f3.9d2aff89-acdc-427a-a30b-00558d34fe4a.jpg","twitter":null,"id":"4d09a438-15e3-4791-bb45-def422b9d0f3"}],"multipleSpeakers":false},{"id":"d34bd438-1023-4a97-b6a2-cca5548d43a6","title":"Break","description":"Generated break","startsAt":"2020-06-19T19:00:00Z","endsAt":"2020-06-19T19:30:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":true,"duration":30,"speakers":[],"multipleSpeakers":false},{"id":"205886","title":"From Combat To Code: How Vets Who Code Trained Over 250 veterans how to Code and Get Jobs For Free","description":"A detailed origin story of how I became known as the Web's Captain America and how Vets Who Code trains veterans for free. We will go over how we came to be, how we train our troops, our teams and how you can help us continue our mission.","startsAt":"2020-06-19T19:30:00Z","endsAt":"2020-06-19T20:00:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Jerome Hardaway","bio":"Jerome Hardaway is a Google Developer Expert (Web) UI/UX engineer, Dev Advocate and Geek At Arms (Founder and Executive Director) of Vets Who Code, a 501(c)3 veteran-led charitable non-profit dedicated to filling the nation’s technical skills gap with early-stage transitioning veterans and military spouses through remote software development training. ","tagLine":"Geek At Arms at Vets Who Code ","profilePicture":"https://sessionize.com/image?f=3ddf75924d7326d8528453c563524b32,400,400,1,0,a55d0d92-d418-49d2-9d74-9507f904133a.jpg","twitter":null,"id":"a96bc92a-349f-43bd-a337-f5e47a25f4df"}],"multipleSpeakers":false},{"id":"205360","title":"What they don't teach you about fundraising as a Black Founder","description":"useneu.com has made 3 attempts at raising capital for our business. Each attempt brought with it some valuable, and often unintuitive, lessons about the fundraising process. Join me as I recount our fundraising experiences and the main lessons learned after each one. Should you ever need to fundraise, you'll know the key DOs and DONTs.","startsAt":"2020-06-19T20:00:00Z","endsAt":"2020-06-19T20:30:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Claudius Mbemba","bio":"Claudius Mbemba was born in Cameroon, Africa to hard-working blue-collar parents who taught him the value of hard work, being a self-starter, and always learning. Immigrating to the US at the age of 7, Claudius saw how technology vastly improved the lives of Americans. It was then his love for technology was born. Following high school, Claudius pursued his Bachelors Degree in Computer Science while on the Varsity Football team at The Ohio State University. Upon completing his degree he accepted employment at Microsoft in Seattle, WA where he worked as a Software Engineer, largely focusing his time on Voice, Mobile, Cloud, Bots, DevOps, ML/AI, & Blockchain. Claudius is currently CTO of Neu Inc, a startup building a marketplace that provides automated hotel-grade turnovers for Airbnb/vacation rentals.<br/><br/>Learn more about Claudius on his website: www.claudiusmbemba.com","tagLine":"CTO @ neu","profilePicture":"https://sessionize.com/image?f=e947ce8b40dbc8bbed9eab6d7f5e3f82,400,400,1,0,4c-07ea-4356-b5b3-29fee8d4b842.a2abfab7-6525-468c-8042-d4df310fab0e.jpg","twitter":"https://twitter.com/mbembaships","id":"ddfecb4c-07ea-4356-b5b3-29fee8d4b842"}],"multipleSpeakers":false},{"id":"205536","title":"Giving Back to Tech without Burnout","description":"You did it! You’re a Software Engineer! After many hours of studying and learning difficult concepts, you made it through. Now you want to volunteer and give back your tech skills to a needed cause. Exciting, right? Wait…here’s a few tips to avoid giver burnout before you start.<br/><br/>In this talk, Mo will discuss ways tech givers can continue to volunteer without spreading themselves too thin. Tips will include: how do you give your talent without depleting your energy, choosing volunteer opportunities or open source projects with great impact, and how to say no.","startsAt":"2020-06-19T20:30:00Z","endsAt":"2020-06-19T21:00:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Mo Hampton","bio":"Mo Hampton is a Software Engineer at GDIT. Her passion for web application development led her to the Open Source community to learn full-stack JavaScript. When not thriving off of coffee, meditation or travel, she builds cost-effective, user-friendly business applications.","tagLine":"Software Engineer @ General Dynamics IT","profilePicture":"https://sessionize.com/image?f=23c06d3c405fc2f4628267b8e688a458,400,400,1,0,2f-0e9e-4181-8a9d-bff10f1161a2.4dc3907d-d3f7-4f6c-be5b-45735f54d617.jpeg","twitter":null,"id":"cf6f0e2f-0e9e-4181-8a9d-bff10f1161a2"}],"multipleSpeakers":false},{"id":"7e6300b4-99f3-4b76-be22-84cd7a8cd353","title":"Break","description":"Generated break","startsAt":"2020-06-19T21:00:00Z","endsAt":"2020-06-19T22:00:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":true,"duration":60,"speakers":[],"multipleSpeakers":false}]},"track3":{"id":0,"title":null,"talks":[]},"track4":{"id":0,"title":null,"talks":[]},"sessions":null,"id":1870,"title":"Day 1"},{"generic":{"eventStartsAt":"2020-06-20T16:00:00Z","eventEndsAt":"2020-06-20T22:00:00Z"},"track1":{"id":3,"title":"Track 1","talks":[{"id":"205790","title":"Keynote: The Reality of Developing an Artificial World","description":"Our world is changing. Artificial intelligence is being employed in just about all walks of life - from virtual assistants to self-driving cars. How does this new way of life impact software development? <br/><br/>In this talk, Angie will share her personal journey in learning how to test the AI-based applications that we develop, and highlight just how important it is to society that we get this right. ","startsAt":"2020-06-20T16:00:00Z","endsAt":"2020-06-20T17:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":60,"speakers":[{"fullName":"Angie Jones","bio":"Angie Jones is a Senior Developer Advocate who specializes in test automation strategies and techniques. She shares her wealth of knowledge by speaking and teaching at software conferences all over the world, writing tutorials and technical articles on angiejones.tech, and leading the online learning platform, Test Automation University.<br/><br/>As a Master Inventor, Angie is known for her innovative and out-of-the-box thinking style which has resulted in more than 25 patented inventions in the US and China. In her spare time, Angie volunteers with Black Girls Code to teach coding workshops to young girls in an effort to attract more women and minorities to tech.","tagLine":"Senior Developer Advocate","profilePicture":"https://sessionize.com/image?f=9fd48696ad7490d63d5581d884120a0c,400,400,1,0,4540110a-dbd5-4770-8754-1571adc82bee.jpg","twitter":"https://twitter.com/techgirl1908","id":"6b0134fe-89a7-48b6-a245-7471eacd01e9"}],"multipleSpeakers":false},{"id":"205828","title":"Town Hall","description":"#BlackLivesMatter: What Next","startsAt":"2020-06-20T17:00:00Z","endsAt":"2020-06-20T18:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":60,"speakers":[{"fullName":"Lance Goudy","bio":"Lance Goudy is a technology veteran with over 30 years of experience in the tech space. He is the and CEO of Goudy Management Group and the Executive Director of Information Technology for The Potter's House of Dallas. With an extensive background in technology management, convergence, cybersecurity, e-commerce, and cloud technologies, Lance has a proven track record of guiding organizations through achieving reliable, secure, and scalable objectives. Some of his proudest professional achievements include: the first public air-to-ground communication system onboard commercial airliners; the network infrastructure and security for the 1996 Summer Olympic Games; developing curriculum for advanced robotics, lasers, and microprocessors; serving as department chair of network engineering and advanced digital circuitry & microprocessors for Computer Dynamics Institute.<br/>Lance served as Sr. Network Engineer and Manager of engineering for the Christian Broadcasting Network cultivating 10 years of experience in converging IT and broadcast television. He is an accomplished musician and enjoys teaching Python in his spare time.<br/>","tagLine":"Goudy Management Group, CEO","profilePicture":"https://sessionize.com/image?f=0bf40323e75c95d95c6e0a423f83164d,400,400,1,0,42-b4e1-4da8-9e59-7340f5b2873a.e6681777-6b6b-462e-8677-0055f1e70a8c.png","twitter":null,"id":"87f23e2c-a365-4068-bc39-55fba48e993a"},{"fullName":"Kimeka Campbell","bio":"TBD","tagLine":"TBD","profilePicture":"https://sessionize.com/image?f=cc3babd0de11dd0ccd4868130a41e916,400,400,1,0,42-b4e1-4da8-9e59-7340f5b2873a.bb9cac92-31bf-425e-a6d4-59b6c71a90a9.png","twitter":null,"id":"2485ba3e-a220-42f2-8340-4ca7fada27d0"},{"fullName":"Michael Brown","bio":"Michael Brown has 25 years of software development experience primarily as a consultant. He has designed and developed solutions for a multitude of organizations both public and private from small startups to fortune five hundred companies across an array of industries. He has recently joined Microsoft where he brings his experience and expertise to help customers leverage Azure services to create solutions.","tagLine":"Senior Software Engineer at Microsoft","profilePicture":"https://sessionize.com/image?f=644c5961a27cc76bbec5323929ae66e5,400,400,1,0,8b-9cbe-4acc-befb-e0ced1ff9ff8.13239c46-b1fa-4f54-8282-d184c77eacb8.jpg","twitter":"http://twitter.com/browniepoints","id":"48dde28b-9cbe-4acc-befb-e0ced1ff9ff8"},{"fullName":"Nicole Tinson","bio":"TBD","tagLine":"TBD","profilePicture":"https://sessionize.com/image?f=49e438b79de183cc85d9c5539e516d4c,400,400,1,0,42-b4e1-4da8-9e59-7340f5b2873a.c7405c0f-429c-4d11-93d2-978bdf8dd5d7.png","twitter":null,"id":"ec940278-3f74-42f5-9cea-85fda9e37601"},{"fullName":"Franklin Rosado","bio":"TBD","tagLine":"TBD","profilePicture":"https://sessionize.com/image?f=998f1e3c972161017c5518460c913b57,400,400,1,0,42-b4e1-4da8-9e59-7340f5b2873a.79227f74-da83-47cc-9cb8-86c25e01288f.png","twitter":null,"id":"808d8cfa-940e-438e-b3d1-a4dc1cfb03d0"}],"multipleSpeakers":true},{"id":"205468","title":"Innovating on OUR STEM Education","description":"What is an IQ? Why do we take the SATs? How did it end up even being a metric of childhood success? Senior Software Engineer walks through 100 years of modern education and how it has been systematically flawed for underrepresented communities. NSBE Jr. Bay Area takes on this challenge by innovating outside of the parameters of the education system.<br/><br/>My talk challenges the status quo of common core, standardized tests and looks to technologists, innovators and entrepreneurs as a call to action to remodel education for people of color.","startsAt":"2020-06-20T18:00:00Z","endsAt":"2020-06-20T18:30:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Nate Rose","bio":"Nate Rose is a Senior Software Engineer with a background in DevOps, Data Engineering, and Distributed Cloud Infrastructure Systems. Outside of engineering at Ripple, he does research in neurotechnology, casually overfits ML models and works with building education equity through non-profits like AI4ALL and NSBE.","tagLine":"Senior Software Engineer at Ripple","profilePicture":"https://sessionize.com/image?f=78e72ad517b719b3208c91561f3b0589,400,400,1,0,ac-63a4-463a-8fcb-18114d633994.f4367619-2e8c-4487-b76c-7e2d4aeb9ff0.jpg","twitter":"https://twitter.com/naterose2","id":"bb1610ac-63a4-463a-8fcb-18114d633994"}],"multipleSpeakers":false},{"id":"205531","title":"What does culturally responsive teaching mean in an online environment?","description":"Culturally responsive teaching (CRT) is an instructional approach that seeks to ensure academic success while developing students' sense of culture and social-political awareness. CRT allows students to see themselves in the curriculum and assignments provided by the teacher. In the online and traditional classroom, CRT provides opportunities for students to learn how to value their culture. During this time in America, it is especially important for students to have opportunities to express themselves while using online technology.","startsAt":"2020-06-20T18:30:00Z","endsAt":"2020-06-20T19:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Dr. Tressa Matthews","bio":"Dr. Tressa Matthews has been teaching math to middle and high school students for 18 years.  She has a Bachelor's in Industrial and Operations Engineering from the University of Michigan.  After two years in corporate America, she decided to pursue her passion for secondary mathematics.  After earning a Masters and Doctorate in Education, Dr. Matthews co-founded Clever Math to provide online educational services for students and parents.  She has a passion for building supportive classroom environments for African-American students which became the basis for her doctoral research.","tagLine":"Clever Math LLC , Co-Founder","profilePicture":"https://sessionize.com/image?f=da2755bf9e39b6f3db30752fb209d19b,400,400,1,0,4d-9226-4deb-b654-876bbb89d832.244654b5-858d-451b-8f43-2c2c1dbb4562.jpeg","twitter":null,"id":"e0bf324d-9226-4deb-b654-876bbb89d832"},{"fullName":"Dr.  Jennifer Banks","bio":"Jennifer D. Banks, Ph.D. is currently the Mathematics and Science Coordinator for Washtenaw County.  For nearly 20 years, Dr. Banks has served as a teacher and instructional leader at various levels.  Jennifer is passionate about empowering educators and learners, to ensure that all students have equitable access and opportunities to learn and engage in high-quality rigorous mathematics.  Over the past ten years, she has intently worked to expand K-12 educators' understanding of culturally responsive instruction, specifically in the area of mathematics.  Dr. Banks holds a bachelors' Industrial and Operations Engineer and worked in the corporate sector for 4 years.  She has been recognized by various community organizations for her work in expanding access to STEM education, including the Rhonda Walker Foundation and DAPCEP.  She currently serves on the Michigan Early Mathematics Taskforce and is a lecturer for the University of Michigan. Furthermore, she is the Co-Founder of Clever Math, LLC.<br/>","tagLine":"Clever Math, LLC Co-Founder","profilePicture":"https://sessionize.com/image?f=41284bb23c90c0c48853ad5d3a80dc55,400,400,1,0,a499879c-aca4-4752-8910-14b3790846e2.jpg","twitter":null,"id":"e21dc742-0832-4c9f-aeb6-9a1e6e0f8e99"}],"multipleSpeakers":true},{"id":"205827","title":"Lightning Interviews","description":"Danny Thompson will prerecord a series of interviews, which will stream consecutively during this time.","startsAt":"2020-06-20T19:00:00Z","endsAt":"2020-06-20T20:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":60,"speakers":[{"fullName":"Danny Thompson","bio":"https://dev.to/dthompsondev/from-frying-chicken-in-gas-stations-to-becoming-a-software-engineer-4ff4","tagLine":"Software Engineer, Meetup organizer and podcast host for \"Commit your code!\"","profilePicture":"https://sessionize.com/image?f=678281290f4aec93ca95a90a9c9942e2,400,400,1,0,d0-7999-4ca0-9ff5-e55622409a8e.ec1f102f-7be4-4e4a-83ac-494a5f5d74d3.jpeg","twitter":null,"id":"179430d0-7999-4ca0-9ff5-e55622409a8e"}],"multipleSpeakers":false},{"id":"205515","title":"Is Headless CMS the future of development?","description":"As digital products continue to evolve, so does the content we consume. A scalable, cross-platform content management system is crucial to ensuring a product’s growth velocity. Traditional CMS gives the comfort of having the content, the editing interface, templates, and custom codes, in a single environment. But with the changes in this mobile era, that’s no longer enough. We need a new breed of CMS — one that can make content available through any channel at which point a Headless CMS is required.<br/><br/>Headless CMS, is a backend-only content management system that allows developers to create, store, manage, and publish the content over an API. It gives developers the power to quickly build excellent user experiences, free from the worry of its impact on the back-end business logic.","startsAt":"2020-06-20T20:00:00Z","endsAt":"2020-06-20T20:30:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Blessing Krofegha","bio":"Blessing Krofegha is a dynamic Software Engineer with a drive to create marketable solutions to global businesses.<br/>He is also a Technical author at Smashing Magazine and LogRocket.","tagLine":"Software Engineer and Technical Writer","profilePicture":"https://sessionize.com/image?f=01d8ca60e7f0df20616065f7803864eb,400,400,1,0,5abc3869-8f65-4dc1-bbbd-54fa1d23a14a.jpg","twitter":"https://twitter.com/beveloper","id":"0ea35f5e-57cc-4f9f-8854-40e1b533ff8c"}],"multipleSpeakers":false},{"id":"205540","title":"Through Programming I became a better Artist","description":"Code is my new favorite artistic medium. Creating art was once the only activity that put me in a flow state that was until I started coding. Programming like art is full of processes, speed bumps, errors, eustress, and joy. My skills as an artist have proven to be an asset in programming. While programming has cultivated artistic improvements.<br/><br/>What: More artists should learn to code.<br/>Why: You’re skills as an artist are an asset in the programming world and vice versa programming can cultivate artistic improvements.<br/>How: Personal Anecdote detailing skills.","startsAt":"2020-06-20T20:30:00Z","endsAt":"2020-06-20T21:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Shukri Abdullahi N/A","bio":"Shukri Abdullahi is a Self-Taught Programmer and Multi-disciplinary Artist based in New York. ","tagLine":"Programming is an Art Form!","profilePicture":"https://sessionize.com/image?f=c7efcf99eb68d8a56e6d8f59a451657d,400,400,1,0,45ce3c06-8da0-492d-a3d5-bc7baa743be6.jpg","twitter":null,"id":"553cb856-dc47-4bd5-ac1f-234a4f1c1a45"}],"multipleSpeakers":false},{"id":"205545","title":"Session on Intellectual Property rights","description":"The slave who made the whiskey, Jack Daniel, was not given recognition until 2016. This recognition was 150 years late. This is not an isolated incident as there are several instances in the past where inventions and ideas by black people were stolen.<br/><br/>So much has changed all over the world, especially in countries where the rights of black people have always been a subject of constant worry and discuss. A 2016 study found that black Americans “apply for patents at nearly half the rate of whites\". This shows that a lot still needs to done to protect the intellectual property rights of black people in tech.<br/><br/>In my session, I will address the subject of what intellectual property rights are, how they can be protected and what the black community can do to help facilitate this protection.","startsAt":"2020-06-20T21:00:00Z","endsAt":"2020-06-20T21:30:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Mark Okhakumhe","bio":"Mark is a trained lawyer and mediator actively building a career in tech & innovation, corporate practice, intellectual property, dispute resolution, and impact investment. <br/><br/>He enjoys speaking to people on emerging areas of law, Impact Investment, branding and personal development, startups, and Sustainable Development Goals (SDG), especially SDGs 1, 4, 7, 11 and 16.<br/><br/>As a humanitarian, he volunteered at one of Nigeria's correctional facilities as an ad-hoc lecturer with the National Open Univerisity. He also volunteered with the Legal Aid Council of Nigeria to take on pro bono cases, and DEVATOP to tackle human trafficking.<br/><br/>He was a judge at the regional rounds of the Philip Jessup International Law Moot Competition. More recently, he was part of the #AfricaVsVirus Ideathon and also the COVID-19 Challenge organised by UNICEF.<br/><br/>He has advised various tech startups on matters of compliance and IP protection. He is open to all types of engagements including speaking, volunteer, and full or part-time career opportunities. ","tagLine":"Attorney","profilePicture":"https://sessionize.com/image?f=f90ffb8d69de8c0d4e9ff11ab33db741,400,400,1,0,c2-48fe-4bcb-9990-a76f6f5308ba.95397ce8-dcda-461a-aabf-3a04c2cd00bb.jpg","twitter":null,"id":"1db166c2-48fe-4bcb-9990-a76f6f5308ba"}],"multipleSpeakers":false},{"id":"205462","title":"Grimoire: A Data Centric Blogging Platform","description":"In this talk, I will describe how I built a new blogging platform focused on creating interactive data stories. By the end, you will understand the tools and techniques used to build a serverless first platform and a new place to communicate with data.  ","startsAt":"2020-06-20T21:30:00Z","endsAt":"2020-06-20T22:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Banjo Obayomi","bio":"Banjo is a Senior Research Engineer at Two Six Labs, where he develops platform solutions for productizing various researched-based projects. Banjo is passionate about operationalizing data aka DataOps and has started a podcast and meetup around data.","tagLine":"DataOps Mindset, Full Stack Background, Can't Lose","profilePicture":"https://sessionize.com/image?f=37ed47d9e5ff657e4a56fb01f42f5956,400,400,1,0,9e-603f-4ed6-965b-9dad8885ccc9.97ff5546-0362-4bf0-9c7f-61820e52cd31.png","twitter":"https://twitter.com/banjtheman","id":"7b8e269e-603f-4ed6-965b-9dad8885ccc9"}],"multipleSpeakers":false}]},"track2":{"id":4,"title":"Track 2","talks":[{"id":"585ba1e9-3876-4017-bad4-f72816aa569b","title":"Break","description":"Generated break","startsAt":"2020-06-20T16:00:00Z","endsAt":"2020-06-20T18:00:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":true,"duration":120,"speakers":[],"multipleSpeakers":false},{"id":"205473","title":"The future of tech and how to keep in touch while it evolves","description":"Building and leading communities, one of the common pitfall many people fall in whiles trying to gain grounds in technology has to do with learning every new thing they hear of. It is quite clear that these people think they are doing the right thing until they realize years have passed by and yet they can't build a single project with their knowledge gained. As several people share their stories with me about the same problem, I notice I was in their shoes for my first two years career. In this session, we will address how people who find their self in this category can progress while staying up to date with all new technologies.","startsAt":"2020-06-20T18:00:00Z","endsAt":"2020-06-20T19:00:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":false,"duration":60,"speakers":[{"fullName":"Dawood Iddris","bio":"Dawoodiddris is a software developer, passionately creating products and changing lives with his soft and technical skills by training others in event, workshops and providing platforms for coders to think beyond the limit.","tagLine":"Software & co founder Techloud Inc, Backend Developer  Effect Studios, Microsoft Student Partner ","profilePicture":"https://sessionize.com/image?f=e635a646e1ade36f95027f0e25086b55,400,400,1,0,d6-efce-495f-9cde-97ddcaa425f4.b69d0ee7-1d20-49b2-bfa1-ab8f92a40786.jpg","twitter":"https://twitter.com/dawoodiddris","id":"7d0172d6-efce-495f-9cde-97ddcaa425f4"}],"multipleSpeakers":false},{"id":"6207dde7-e230-4356-8aab-6c338026b310","title":"Break","description":"Generated break","startsAt":"2020-06-20T19:00:00Z","endsAt":"2020-06-20T20:00:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":true,"duration":60,"speakers":[],"multipleSpeakers":false},{"id":"205365","title":"Why You're Not Landing That UX Role","description":"As a UX Coach, the question I am asked the most is \"How do I actually land that UX role?\". While the question is broad, I've identified a few areas where aspiring UX Designers really struggle getting their foot in the door at companies of their choice. In my talk, attendees will walk away being able to not only identify their key problem areas, but have action items around overcoming those obstacles to land their dream role. ","startsAt":"2020-06-20T20:00:00Z","endsAt":"2020-06-20T20:30:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Ashley Janelle","bio":"<br/>As a seasoned User Experience and User Interface Designer, Ashley Janelle focuses on designing customer centered experiences that target her users everyday challenges. At Caterpillar Inc., Ashley taps into user needs while designing solutions that allow them to save time, money, and increase their productivity. <br/><br/>As a UX coach and course creator, she’s developed an online course, “Learn UX Online in 16 Weeks” to help aspiring UX designers go from beginner to experienced UX Designers to land jobs at top companies. Using her UX expertise and passion for working with people, Ashley’s not only helped others land their dream roles, but build the confidence to become successful UX Designers. <br/><br/><br/>https://www.ashleyjanelle.com","tagLine":"UX/UI Designer & UX Coach","profilePicture":"https://sessionize.com/image?f=f4492dfa93616943dd5be87da9af2841,400,400,1,0,687ae03f-126e-48ef-be9b-9116c2016941.jpg","twitter":null,"id":"a3e0e5a9-3980-4234-9fa2-fca935b3ba9f"}],"multipleSpeakers":false},{"id":"205471","title":"For Us, Without Us: Addressing Tech’s Shortcomings in Creating Equity for Black People","description":"Many consider technology to be the “great equalizer”, but it’s evident that Black people are not benefiting at the same rates as others. This session will discuss how the forces that limit Black people’s ability to navigate the physical also prevent us from exerting agency via the digital. Together, we’ll discuss the ways that anti-Blackness is replicated in technology, the discrepancies faced by Black communities due to the digital divide, and the changes required for us to have a more equitable future. Because we can never fully benefit if technology continues to be made for us, without us. ","startsAt":"2020-06-20T20:30:00Z","endsAt":"2020-06-20T21:00:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Jacqueline Gibson","bio":"Jacqueline is a Digital Equity Advocate & Software Engineer building change from the code up. She's interested in leveraging technology for social good, particularly identifying ways in which current technology maintains social inequities and working to eliminate these biases. She strives to understand what is necessary to create systems that everyone, regardless of ability, can use with ease.<br/><br/>She graduated with dual degrees in Computer Science and African & African Diaspora Studies from the University of Texas at Austin. She's currently developing tools to create accessible applications for Android, Windows, and web as part of Microsoft's Accessibility Insights team. ","tagLine":"Software Engineer focusing on accessibility at Microsoft","profilePicture":"https://sessionize.com/image?f=baddd8204e89ae7a6d6e97fd2a9fcdbd,400,400,1,0,c7-3ab5-4aef-9d55-3fee6cd0b065.c97d33e6-c1f4-44dd-8f7d-dfcfee0fc6dd.jpg","twitter":null,"id":"1be155c7-3ab5-4aef-9d55-3fee6cd0b065"}],"multipleSpeakers":false},{"id":"205478","title":"Blackfacts and The Wakanda Technology Platform - Technology By Us/For Us/About Us","description":"The subject of 'Inclusion' in the Tech Industry is a hot topic today.<br/><br/>In 1990, when my employer at the time declined to offer to reimburse me for programming classes I was thinking of taking, the only thing I asked them for was to amend my employment agreement to not claim ownership of anything I built, or in other words, not get in my way.<br/><br/>They agreed, and I taught myself to code by reading books and launched a programming career that has now spanned close to three decades.<br/><br/>When I was able to quit that job a couple of years later from revenue from a product I wrote in my basement apartment, I realized the wide open opportunities available in the world of technology, and committed myself to creating technologies to help 'Bring Communities of Color Into the Information Age.'<br/><br/>Today, I have built a technology platform that powers my 23-years-running website Blackfacts.com, designed to provide Black schools, organizations and businesses with content and technology services on a global basis.<br/><br/>This talk will describe and demonstrate some of the components of the platform, called the Wakanda Technology Platform, inspired by a sub-text of the fictional nation of Wakanda, who was able to protect its culture and people because they were in possession of superior technology.<br/><br/><br/><br/>","startsAt":"2020-06-20T21:00:00Z","endsAt":"2020-06-20T22:00:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":false,"duration":60,"speakers":[{"fullName":"Ken Granderson","bio":"Ken is a Digital Visionary and Pioneer who launched Blackfacts.com (the Internet's first Black History Encyclopedia) in 1997, put his former community of Roxbury online in 2002, and created the web site for the Caribbean island nation of Saint Lucia in 2013.<br/><br/>His 25-year commitment to build cutting-edge technologies to benefit communities of color has resulted in him building online systems decades ahead of their time, and today the platform he architected for Blackfacts, called the Wakanda Technology Platform, is positioned to become a leading provider of Global Black News and other services, and the only  such platform created by a Black person.<br/><br/>Ken's Digital Archive of news stories, videos and presentations is at http://kengranderson.com","tagLine":"Digital Visionary, Pioneer and Entrepreneur","profilePicture":"https://sessionize.com/image?f=7c96c02fd2fe2c9f1376ba08cfd524c1,400,400,1,0,8f-f092-4da4-bd7c-34b9f15e21bb.5b6a0d79-d75f-4889-b8f1-25b46d55c39f.jpg","twitter":null,"id":"a1c12f8f-f092-4da4-bd7c-34b9f15e21bb"},{"fullName":"Dale Dowdie","bio":"Dale Dowdie founded Intellitech Consulting Enterprises in 1993, the 3rd company he had started since his first company started while still in college. The goal of Intellitech is to provide intelligent technology solutions for business and educational institutions. Over the past 20 years, Intellitech has provided Software Development, Management/IT Consulting, Disaster Recovery/Business Continuity and Consulting Services for organizations, banks and institutions including Liberty Mutual Insurance, Citizens Bank, TJX Companies, Staples and McCormick, to the Government of St. Lucia and Harvard University.<br/><br/>The company has weathered many storms and adjusted its services to meet the ever changing technology demands of the industry. Intellitech continues to grow its customer base in a market that demands effective computing via local/wide-area networking, custom software development database customization, Internet/Intranet services, and systems integration services.<br/><br/>Mr. Dowdie studied computer engineering at Boston University, with a successful track record working for organizations such as the Goddard Space Flight Center(NASA), Lotus Development Corporation, Wang, IBM, and MCI. Over time, that client base evolved to including major banks (Bank of Boston, USTrust, Citizens Bank), Insurance Companies (Liberty Mutual), Healthcare (University Hospitals of Cleveland, Hoffman LaRoche), Biotech (Genzyme) and Retail (Staples, TJ Maxx Companies) organizations. Intellitech has also developed a core vertical market software development team that designs industry specific web/mobile enabled solutions.<br/><br/>One such solution is BARBinc.com. This idea started in 2009 when Mr. Dowdie was frustrated with having to wait when he arrived at his barber for his scheduled appointment. It seemed that his barber had no tools for tracking or managing appointments, nor did he have a web presence. Given Mr. Dowdie’s background, he thought that maybe there was a way that technology could be used to address these issues. However, nothing really progressed with this kernel of an idea until 2011, when Mr Dowdie decided to make the idea a reality.<br/><br/>BARBinc.com was implemented as a Service (created and powered by Intellitech) which would provide Technology solutions for the Hair and Beauty Industry. In the space of a few years, BARBinc.com went from a simple idea to the #1 source of Barbering News and Information on the internet. In 2014, the BARBinc Newswire Service had a following of 19 people and a social media reach of less than 100. By 2017, it had over 50,000 followers and social media reach of over 30 Million. The industry specific services include online and mobile scheduling and shop management, a national directory of barbers/shops/salons/schools, a marketplace to buy and sell industy products, a mobile portal for news, information and event management with more services coming soon. BARBinc.com has customers from the National Association of Barber Boards of America to Bronner Brothers International Hair Show. BARBinc Educators include some of the top Trainers and Educators in the Industry. BARBinc Total Event solutions have been utilized to sell tickets and manage events for some of the biggest hair shows and barber battles in the industry.<br/><br/>Another Solution is BlackFacts.com. Blackfacts is the brain-child of longtime friend and collaborator Ken Granderson, and over the past 20 years it has been running and providing historical facts-of-the-day to our community. Mr. Dowdie was brought in early on to help husband the idea to the next level. However, for years the site remained just a source of black history facts, and in time it grew to be the #1 source for Black Facts on the internet. That all changed in 2017, as Mr. Dowdie and Mr. Granderson finally gave the project the focus it deserved and thus began the process of turning Blackfacts.com from just a historical reference site for Black History into the 'Black Wikipedia' and a showcase of the cultural contributions of people of color and a showcase of the type of technology solutions that can be provided by and to people of color. Those efforts can be seen in this, the latest evolution of BlackFacts.com. There is so much that can be done with the platform, and we hope that you stick around to enjoy the journey with us...<br/><br/>“We are here to alleviate any issue the client is having with new technology, whether that be training, web site development, or networking,” says Mr. Dowdie, who takes pride in understanding the delicate balance of working with people and technology. “Technology may be our future, but people are making the decisions on how it will best benefit their business needs. Our primary focus is to bridge the gap between technology advancement and realistic solutions for companies.”<br/><br/>As a leading edge business based in Boston, MA, Intellitech has a diverse staff of team members with the background and expertise to satisfy clients from around the world. “Human connection is not lost in the Internet, it is only expanded. Our solutions always keep that fact in mind and in the forefront of the minds of our customers.”<br/><br/>Intellitech Website: www.intellitech.net<br/>BARBinc.com Website: www.barbinc.com<br/>BARBinc.com Newswire: news.barbinc.com<br/>Black Facts Website: www.blackfacts.com","tagLine":"Co-Founder/CEO","profilePicture":"https://sessionize.com/image?f=285981226dbb94ee8bec52d4795709d9,400,400,1,0,35f3d344-2391-49cd-8e76-ea63536f774f.jpg","twitter":"https://twitter.com/blackfacts","id":"1c5f2590-bbb4-475f-8b3e-ef5dcf0590bf"}],"multipleSpeakers":true}]},"track3":{"id":0,"title":null,"talks":[]},"track4":{"id":0,"title":null,"talks":[]},"sessions":null,"id":6006,"title":"Day 2"}]}
