{"sessions":[{"id":"205726","title":"Day 1 - Keynote 1","description":"TBA","startsAt":"2020-06-19T16:00:00Z","endsAt":"2020-06-19T17:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":60,"speakers":[{"fullName":"TBA TBA","bio":"TBA","tagLine":"TBA","profilePicture":"https://sessionize.com/image?f=3b71e433b680ee6618cf8c2ec83026a5,400,400,1,0,2a-4204-42f0-9ba8-d7b9c6f67226.585b3f19-716e-4619-b6b1-115646049a6f.png","twitter":null,"id":"2f00c7b5-1f29-4220-94d9-4d7c499899e2"}],"multipleSpeakers":false},{"id":"205532","title":"Why teenagers should learn JavaScript","description":"I am Kumar Abhirup, a 16 year old from India. I am here to share my journey of how a school-hating kid can start to love his own life! Programming is not a child's play, you think?? Think again. ","startsAt":"2020-06-19T17:00:00Z","endsAt":"2020-06-19T17:20:00Z","roomId":"14064","language":null,"youtube":null,"isBreak":false,"duration":20,"speakers":[{"fullName":"Kumar Abhirup","bio":"I am 16-year-old JavaScript React Developer from India who builds cool projects since 2018. I am specialized in building full-stack applications that use React in frontend and GraphQL in the backend. I am in the evergreen process of learning, and I am loving it! I am also a 10th grader!<br/><br/>GitHub: https://github.com/KumarAbhirup<br/>Website: https://kumarabhirup.me<br/>Twitter: @kumar_abhirup<br/>DEV: https://dev.to/kumar_abhirup<br/>Medium: https://medium.com/@kumar_abhirup<br/>LinkedIn: https://linkedin.com/in/kumar-abhirup/<br/><br/>❤️ Node.js and React.js","tagLine":"16yo JavaScript Developer","profilePicture":"https://sessionize.com/image?f=e463b1d45c655cf28cbf1eb18bb2b7fd,400,400,1,0,199503f0-02f1-4589-8eb3-f63284c558cf.jpg","twitter":null,"id":"6212c3ca-b2f3-4aae-bcc1-e158a0c73563"}],"multipleSpeakers":false},{"id":"205452","title":"Combatting Bias in Machine Learning","description":"In this talk I cover how to see the bias in your data and machine learning models. By giving examples from recent research on biased facial recognition systems as well as cutting edge explainability algorithms, attendees can expect clarification on what bias means in machine learning.","startsAt":"2020-06-19T17:00:00Z","endsAt":"2020-06-19T17:30:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Ayodele Odubela","bio":"Ayodele Odubela is a Data Scientist working on driver risk mitigation at SambaSafety in Denver, CO. Previously she earned her Master's degree in Data Science after transitioning to tech from social media marketing. She's created algorithms that predict consumer segment movement, goals in hockey, and the location of firearms using radio frequency sensors. ","tagLine":"Data Scientist at SambaSafety","profilePicture":"https://sessionize.com/image?f=bb5c451a1ca33549ff77eb81c90601d6,400,400,1,0,a7-e484-40e8-8e70-f62435aca9fd.0ea2f563-04c6-476a-9f79-5a5e4a8ef681.png","twitter":"http://www.twitter.com/ayodeleohh","id":"2a59bea7-e484-40e8-8e70-f62435aca9fd"}],"multipleSpeakers":false},{"id":"205366","title":"The Ideal Community Model: Lessons Learned","description":"There are many ways to push your career to a point it takes a great turn, but I found out in 2017 that community participation is a must. Community involvement can be anything from Open Source Contributions, Writing articles, answering questions on social media/StackOverflow to speaking at conferences. Participation in your community will expand your network. <br/><br/>By attending small meetups or having conversations in slack channels will lead you to meet new people in your industry. Sharing will increase your visibility in the ecosystem by Founders, people of related skill sets, recruiters, and more. <br/><br/>There isn’t just one way to share your expertise with your community. Open Source Contributions isn't just code, you can write articles/documentation about the product you would like to contribute to about your experiences or speak at conferences. Collaboration helps you to be seen as a leader in your community. You can collaborate with others in your network by mentoring, organizing an event, or working together on a personal project/ideas<br/><br/>I learned most of the things I know today about the community the hard way because I never saw it as anything important, and all I cared about was just write the code and today I am a Senior Developer Advocate at Fleek,  and also the lead organizer of some major communities in Africa which included, unStack, Developers Circles Lagos from Facebook, Open Source Community Africa, NaijaHacks, and AfricaHacks.<br/><br/>Key Takeaways:<br/><br/>1) They will understand how to get started with contributing to a community as a person<br/>2) They will understand why to contribute to a community<br/>3) They will learn how to build a community on their own<br/>4) They will learn how to find a community that is just like you wherever you are<br/>5) They will learn how open-source works in a community<br/>6) They will learn how to contribute to ideas in the community <br/>7) Most of all, They will learn how to add and receive value from a community","startsAt":"2020-06-19T17:00:00Z","endsAt":"2020-06-19T17:30:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Shodipo Ayomide","bio":"Shodipo Ayomide is a Developer Advocate, Engineer, and Occasional Designer, who also contributes to a lot of open-source projects over on GitHub, he also runs some major communities like unStack, Developers Circles Lagos from Facebook, Open Source Community Africa and NaijaHacks driving Nigeria & Africa forward in Technology, he is an international speaker who has spoken at a lot of conferences over time in various locations, in his free time he loves to, Read, See a Movie and Occasionally play video games, Loves Travelling and Family.<br/>","tagLine":"Senior Developer Advocate at Fleek","profilePicture":"https://sessionize.com/image?f=620438df2143939ff9c4103d63952deb,400,400,1,0,18-b136-4f7e-9db8-32ffcdebfa26.4dd1567c-3ca5-4f41-a914-7f1c7bbacf8a.jpg","twitter":"http://www.twitter.com/developerayo","id":"999f5218-b136-4f7e-9db8-32ffcdebfa26"}],"multipleSpeakers":false},{"id":"205534","title":"Finding Fish Schools with Artificial Intelligence","description":"As a young Mexican scientist it is hard to be admitted as a solid researcher by peers when you are working on a innovative field. Firstly because you are young and secondly because you are not from a tech top tier country.  ","startsAt":"2020-06-19T17:20:00Z","endsAt":"2020-06-19T17:40:00Z","roomId":"14064","language":null,"youtube":null,"isBreak":false,"duration":20,"speakers":[{"fullName":"Miguel Reynaga","bio":"Biologist from Metropolitan Autonomous University, MS in Sustainable Societies. Twice awarded with the Academic Excellence Scholarship by the Secretariat of Public Education of Mexico and 1st place of the XVII Best Research Experience Award, Dr. Ramon Villarreal 2016 by the National Association of Universities and Higher Education Institutions of Mexico. ","tagLine":"MiguelReynaga.com ","profilePicture":"https://sessionize.com/image?f=564c28d17d06e52fbce94fc5351ca0ad,400,400,1,0,e3-b3a0-48dd-bb31-720c761f5065.3f35492b-636d-417c-b2be-09345a33cce5.jpeg","twitter":null,"id":"808f2be3-b3a0-48dd-bb31-720c761f5065"}],"multipleSpeakers":false},{"id":"205477","title":"Empowered by Imposter Syndrome","description":"Imposter syndrome is something that the industry continues to represent as a negative. My take on this as a black woman in tech is we need to turn all of our disadvantages into growth opportunities. Adding structure to our learning path is the best way of removing the negative image of feeling like an imposter and allows us to flourish.","startsAt":"2020-06-19T17:30:00Z","endsAt":"2020-06-19T18:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"valerie sharp","bio":"Valerie Sharp is a Founder & CEO at Tech By Choice and a Senior Software Engineer at Mastery Logistics. She holds a BS in Psychology & Art. Valerie is passionate about creating secure human-centered digital experiences. As a successful self-taught developer, Valerie started Tech By Choice to give back to the community that helped her succeed.","tagLine":"Founder & CEO of Tech By Choice","profilePicture":"https://sessionize.com/image?f=5e531b9f3095c9c624b2ab7dcfff2c5a,400,400,1,0,2a-4204-42f0-9ba8-d7b9c6f67226.c9b06da4-8cb4-46fc-a087-a7207a204e81.png","twitter":null,"id":"71fee9c9-b6b5-42a6-a6e5-18b825681c3f"}],"multipleSpeakers":false},{"id":"205535","title":"Breaking into Tech: From the Trenches","description":"This talk will share my personal obstacles from a non-traditional career path (Veteran, women of color, mother and coding bootcamp graduate) to a Software Engineer. ","startsAt":"2020-06-19T17:30:00Z","endsAt":"2020-06-19T18:00:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Mo Hampton","bio":"Mo Hampton is a Software Engineer at GDIT. Her passion for web application development led her to the Open Source community to learn full-stack JavaScript. When not thriving off of coffee, meditation or travel, she builds cost-effective, user-friendly business applications.","tagLine":"Software Engineer @ General Dynamics IT","profilePicture":"https://sessionize.com/image?f=23c06d3c405fc2f4628267b8e688a458,400,400,1,0,2f-0e9e-4181-8a9d-bff10f1161a2.4dc3907d-d3f7-4f6c-be5b-45735f54d617.jpeg","twitter":null,"id":"cf6f0e2f-0e9e-4181-8a9d-bff10f1161a2"}],"multipleSpeakers":false},{"id":"205485","title":"Terraform, the de facto infrastructure as code for cloud service provisioning","description":"Terraform is an amazing toolset for automating infrastructure in the public and private cloud. This session will teach you the fundamentals of Terraform to deploy infrastructure in a consistent, repeatable manner across multiple services.","startsAt":"2020-06-19T17:40:00Z","endsAt":"2020-06-19T18:00:00Z","roomId":"14064","language":null,"youtube":null,"isBreak":false,"duration":20,"speakers":[{"fullName":"Devlin Duldulao","bio":"Devlin Duldulao is a Filipino full-stack cloud engineer based in Norway. He is a Microsoft MVP, an Auth0 Ambassador, a trainer, an international conference speaker, and a senior consultant at Inmeta. He loves going to universities and user groups to share his expertise.","tagLine":"Microsoft MVP, Senior Consultant at Inmeta","profilePicture":"https://sessionize.com/image?f=dce5e2a4caf000389171617f51cce034,400,400,1,0,53378d1f-064c-46f3-bef3-af4e3301127d.jpg","twitter":"https://twitter.com/DevlinDuldulao","id":"ca350f30-7945-4b1c-8a23-663346e39e88"}],"multipleSpeakers":false},{"id":"205515","title":"Is Headless CMS the future of development?","description":"As digital products continue to evolve, so does the content we consume. A scalable, cross-platform content management system is crucial to ensuring a product’s growth velocity. Traditional CMS gives the comfort of having the content, the editing interface, templates, and custom codes, in a single environment. But with the changes in this mobile era, that’s no longer enough. We need a new breed of CMS — one that can make content available through any channel at which point a Headless CMS is required.<br/><br/>Headless CMS, is a backend-only content management system that allows developers to create, store, manage, and publish the content over an API. It gives developers the power to quickly build excellent user experiences, free from the worry of its impact on the back-end business logic.","startsAt":"2020-06-19T18:00:00Z","endsAt":"2020-06-19T18:30:00Z","roomId":"14064","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Blessing Krofegha","bio":"Blessing Krofegha is a dynamic Software Engineer with a drive to create marketable solutions to global businesses.<br/>He is also a Technical author at Smashing Magazine and LogRocket.","tagLine":"Software Engineer and Technical Writer","profilePicture":"https://sessionize.com/image?f=01d8ca60e7f0df20616065f7803864eb,400,400,1,0,5abc3869-8f65-4dc1-bbbd-54fa1d23a14a.jpg","twitter":"https://twitter.com/beveloper","id":"0ea35f5e-57cc-4f9f-8854-40e1b533ff8c"}],"multipleSpeakers":false},{"id":"205543","title":"Empowerment to the People!  What You Need to Know about Black People, Disability, and Accessibility","description":"About one fifth (20%) of the global population lives with disabilities.​ According to the 2017 American Community Survey, 13.6 percent of Black and African Americans have a disability. Further, the unemployment rate for people with disabilities is almost double of other people, and the people with disabilities who are employed have lower earnings, in general. This means we have an opportunity and a duty to empower Black people with technology. One of the most powerful ways we can do this is to make messaging and technology accessible.<br/><br/>While many of us have heard that accessibility is important, we seldom hear about how to implement it in our everyday work. Angela will discuss how people in every discipline can do so and further amplify the voices of Black people.","startsAt":"2020-06-19T18:00:00Z","endsAt":"2020-06-19T19:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":60,"speakers":[{"fullName":"Angela Hooker","bio":"Angela Hooker is a Senior Accessibility Product Manager at Microsoft, where she's built a center of expertise for accessibility, user experience, and universal design. She's brought her web management, development, design, accessibility, and editorial and content management expertise to the government and private sector for over 20 years. Angela also advocates for role-based accessibility and believes that teaching people how to incorporate principles of accessibility in their everyday work creates a sustainable program and produces the most accessible user experiences. Angela speaks on and writes about accessibility, disability, user experience, and plain language.","tagLine":"@AccessForAll","profilePicture":"https://sessionize.com/image?f=9854c3f5f97b02caa8997f42e02de101,400,400,1,0,2a-4204-42f0-9ba8-d7b9c6f67226.355e98e5-89fd-442d-b2b5-a066a99cdfb7.png","twitter":null,"id":"f2f7fe26-aa6c-4e2e-96c8-2ecfa8c07a99"}],"multipleSpeakers":false},{"id":"205542","title":"Your Startup: How to Launch, Capitalize and Win - Against All Odds","description":"This is a 50-minute presentation (+10 minutes for Q&A) with the goal of providing much-needed information on how to plan a startup, launch and raise capital. I will also intersperse the presentation with examples from my real-life experience of launching a robotic service company as well as experience gained from several other successful startups that I was fortunate to join on their respective journeys.","startsAt":"2020-06-19T18:00:00Z","endsAt":"2020-06-19T19:00:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":false,"duration":60,"speakers":[{"fullName":"Jeff Debrosse","bio":"Jeff Debrosse is a technology and cybersecurity industry veteran and is currently the founder and principal at Sympler where he runs the company's daily operations around designing and building core security architectures, contact-tracing solutions for COV!D-19 and robotics solutions. Prior to founding Sympler, Jeff was the Chief Technology Officer for Adaptive Motion Group where he led development on the navigation and security architectures of AMG’s autonomous systems. Jeff also founded and led NXT Robotics from 2014-2017. In his role as CEO, Jeff raised the company’s seed round of funding and as CTO he designed and built the security, vision, navigation and sensor integration frameworks. <br/><br/>Jeff also led the cybersecurity, R&D and product development teams at Websense (acquired by Vista Equity Partners), ESET LLC. and Ntrepid Corporation. He also worked on classified projects for the intelligence community where he created and deployed increasingly effective and sophisticated cybersecurity solutions across a broad spectrum of requirements. Jeff has spoken at leading conferences such as Gartner, RSA, BlackHat, defCon and other events across the globe. Jeff has a BS in IT Management and he is currently an adjunct faculty member of San Diego State University’s (SDSU) Homeland Security Program.  <br/>","tagLine":"Principal, Sympler LLC","profilePicture":"https://sessionize.com/image?f=827a2cafdf02a14ed94f413d35635472,400,400,1,0,38-15e3-4791-bb45-def422b9d0f3.9d2aff89-acdc-427a-a30b-00558d34fe4a.jpg","twitter":null,"id":"4d09a438-15e3-4791-bb45-def422b9d0f3"}],"multipleSpeakers":false},{"id":"205281","title":"Electronic Tales's session","description":"We want to talk about our community project, Electronic Tales, which will be based on a learning platform aimed at junior developers. By showing our project, we will discuss topics such as what is computer culture, normativity in IT and the toxic myth of \"the super geek\". Our goal is to create a \"coding safe space\": a space where junior developers feel included and free to share their insecurities, tips and knowledge.<br/><br/>IMPORTANT : this talk has already been given once @ the QueerJS meet up (may 2020).","startsAt":"2020-06-19T18:30:00Z","endsAt":"2020-06-19T19:00:00Z","roomId":"14064","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Elisabeth Fainstein","bio":"I am a french fullstak web developer (Java/JS) since 2017. I am also a web dev instructor. I am queer and feminist. ","tagLine":"Cofounder of Electronic Tales (electronictales.io)","profilePicture":"https://sessionize.com/image?f=0ce4004af5cc464dce0caff6a0826938,400,400,1,0,c7-3b87-4495-9939-0938d3a56f2a.68635ce8-0ad0-43b4-8913-d802bbea7366.png","twitter":null,"id":"52324ac7-3b87-4495-9939-0938d3a56f2a"}],"multipleSpeakers":false},{"id":"205425","title":"Black Queer Living: a history of DIY culture in the Black LBGT+ community","description":"What is DIY culture? How does DIY culture intertwine with the Black LGBT+ culture? Get these questions answered, and learn a few easy beginner DIY tutorials to do on t-shirts! No previous experience required!","startsAt":"2020-06-19T19:00:00Z","endsAt":"2020-06-19T20:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":60,"speakers":[{"fullName":"Harold Jackson N/A","bio":"Harold studied computer science at the University of Texas at Austin. He's started Black Queer Living, a youtube channel dedicated to teaching life skills 101, centering queer and trans* people of color: https://www.youtube.com/channel/UCx3ihWKRcPrTDdhk87M2yeg","tagLine":"Bandana Montana","profilePicture":"https://sessionize.com/image?f=c0abbcd5b636ace581c6a672b961736b,400,400,1,0,69-bc29-4570-824e-31ed1601338e.3cf61c49-4630-412c-a5ef-4cf8095f3593.jpg","twitter":null,"id":"7e8f2669-bc29-4570-824e-31ed1601338e"}],"multipleSpeakers":false},{"id":"205460","title":"Journaling as a Dev","description":"Are you working with impact and purpose? Are you solidly attuned on what you're doing month-to-month with your role? How difficult is it for you to track your accomplishments at work? If any of these questions lead to uncertain answers, then you should learn what it means to journal professionally as a dev. This talk will cover my exploration into journaling and its application to tracking my goals and progress as a software engineer. I will discuss how to set up your journal for any goals and how to score on your performance review!","startsAt":"2020-06-19T20:00:00Z","endsAt":"2020-06-19T20:30:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Brittney Braxton","bio":"Brittney is a software engineer who loves a good cup of tea. In her spare time, she draws illustrations for teaNotes.dev on Instagram. Brittney strives to connect with folks who geek out over code with hopes to contribute to a friendly and inviting tech community.","tagLine":"Software Engineer ","profilePicture":"https://sessionize.com/image?f=f251e2b3e22564e038984f82ae042ebb,400,400,1,0,66-4f67-4eeb-b00b-816f3b5821e7.15a28eab-ec6e-4921-88fa-dba2621b28e5.jpeg","twitter":null,"id":"98b26966-4f67-4eeb-b00b-816f3b5821e7"}],"multipleSpeakers":false},{"id":"205360","title":"What they don't teach you about fundraising as a Black Founder","description":"Practical advice and lessons learned from Neu's failed fundraising attempts.","startsAt":"2020-06-19T20:00:00Z","endsAt":"2020-06-19T20:30:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Claudius Mbemba","bio":"Claudius Mbemba was born in Cameroon, Africa to hard-working blue-collar parents who taught him the value of hard work, being a self-starter, and always learning. Immigrating to the US at the age of 7, Claudius saw how technology vastly improved the lives of Americans. It was then his love for technology was born. Following high school, Claudius pursued his Bachelors Degree in Computer Science while on the Varsity Football team at The Ohio State University. Upon completing his degree he accepted employment at Microsoft in Seattle, WA where he worked as a Software Engineer, largely focusing his time on Voice, Mobile, Cloud, Bots, DevOps, ML/AI, & Blockchain. Claudius is currently CTO of Neu Inc, a startup building a marketplace that provides automated hotel-grade turnovers for Airbnb/vacation rentals.<br/><br/>Learn more about Claudius on his website: www.claudiusmbemba.com","tagLine":"CTO @ neu","profilePicture":"https://sessionize.com/image?f=e947ce8b40dbc8bbed9eab6d7f5e3f82,400,400,1,0,4c-07ea-4356-b5b3-29fee8d4b842.a2abfab7-6525-468c-8042-d4df310fab0e.jpg","twitter":"https://twitter.com/mbembaships","id":"ddfecb4c-07ea-4356-b5b3-29fee8d4b842"}],"multipleSpeakers":false},{"id":"205450","title":"Testing in Production","description":"How do you know your feature is working perfectly in production? If something breaks in production, how will you know? Will you wait for a user to report it to you? What do you do when your staging test results do not reflect current production behavior? In order to test proactively as opposed to reactively, try testing in production! You will have an increased accuracy of test results, your tests will run faster due to elimination of bad data, and you will have higher confidence before releases. This can be accomplished through feature flagging, canary releases, setting up a proper CI/CD pipeline, and data cleanup. You will leave this talk with strategies to mitigate risk, to better your understanding of the steps to get there, and to shift your company’s testing culture, so you can provide the best possible experience to your users. At the end of the day, we don't care if your features work in staging, we care if they work in production. <br/>","startsAt":"2020-06-19T20:00:00Z","endsAt":"2020-06-19T20:30:00Z","roomId":"14064","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Talia Nassi","bio":"Talia Nassi is an international keynote speaker who delivers content on all things testing and quality. She is a developer advocate at Split.io where she works closely with engineering teams globally to ship software more efficiently. She is passionate about feature flagging, canary launches, CI/CD, testing in production, and A/B testing. She has spoken at countless conferences internationally, ranging from audiences of 100 to 2000!","tagLine":"Developer Advocate @ Split","profilePicture":"https://sessionize.com/image?f=3dfbedfe98cc16be27cec5ca2344a038,400,400,1,0,177484a6-7de7-4380-8e5e-2d234b94a094.jpg","twitter":"https://twitter.com/talia_nassi","id":"c8519301-f2c9-4240-bd97-7de34f122d29"}],"multipleSpeakers":false},{"id":"205536","title":"Giving Back to Tech without Burnout","description":"Giving Back to Tech without Burnout<br/>You did it! You’re a Software Engineer! After many hours of studying and learning difficult concepts, you made it through. Now you want to volunteer and give back your tech skills to a needed cause.  Exciting, right?  Wait…here’s a few tips to avoid giver burnout before you start.","startsAt":"2020-06-19T20:30:00Z","endsAt":"2020-06-19T21:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Mo Hampton","bio":"Mo Hampton is a Software Engineer at GDIT. Her passion for web application development led her to the Open Source community to learn full-stack JavaScript. When not thriving off of coffee, meditation or travel, she builds cost-effective, user-friendly business applications.","tagLine":"Software Engineer @ General Dynamics IT","profilePicture":"https://sessionize.com/image?f=23c06d3c405fc2f4628267b8e688a458,400,400,1,0,2f-0e9e-4181-8a9d-bff10f1161a2.4dc3907d-d3f7-4f6c-be5b-45735f54d617.jpeg","twitter":null,"id":"cf6f0e2f-0e9e-4181-8a9d-bff10f1161a2"}],"multipleSpeakers":false},{"id":"205479","title":"Navigating from Rejections","description":"This session is aimed at providing tangible ways to navigate rejections and failures, learning from the situation, building resilience muscle, and finding positivity in moving ahead for future while keeping our head high and our mental wellbeing in check. ","startsAt":"2020-06-19T20:30:00Z","endsAt":"2020-06-19T21:00:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Harpreet Kaur","bio":"Harpreet Kaur is an engineer, public speaker, and an artist. She is a Senior Global Technical Program manager at Microsoft – Cloud and AI with proven track record of leading business and<br/>digital transformation and shipping high quality products/solutions that increase productivity,<br/>standardization/simplification of the enterprise tools, processes and resources. She brings 16+ yrs. of Product, Program, People and Change Management expertise with strategic leadership<br/>experience in multiple industry domains. She believes the rejections on her career journey have shaped her as a strong resilient leader and helped her redefine her professional goals.<br/>Harpreet Kaur holds Master of Computer Applications and is also PMP, CSPO and Prosci Change Practitioner. ","tagLine":"Microsoft - Senior Technical Program Manager","profilePicture":"https://sessionize.com/image?f=8d0f3e84f2e1f979f44a18a297b5ed9d,400,400,1,0,f2-af00-4131-9dbb-5245d5f62f22.c0fae1c8-2b0b-4858-a777-387a8732a498.jpg","twitter":null,"id":"c2e621f2-af00-4131-9dbb-5245d5f62f22"}],"multipleSpeakers":false},{"id":"205428","title":"Your next open source contribution","description":"Today Open Source is ubiquitous and comprises nearly 80% – 90% of the code in a “typical” application. There is a need to use Open Source to stay competitive, but what about the need to use open source to advance your career?<br/><br/>In this talk, I will talk through actionable ways to make open-source contributions to grow your career.","startsAt":"2020-06-19T20:30:00Z","endsAt":"2020-06-19T21:00:00Z","roomId":"14064","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Brian Douglas","bio":"Brian Douglas is a Developer Advocate at GitHub where he works on increasing use of the GitHub API by iterating on the onboarding process and helping users with evergreen technical content.","tagLine":"GitHub Developer Advocate","profilePicture":"https://sessionize.com/image?f=a20f286b686099b2c552beb6055edd7c,400,400,1,0,54-dbbd-41e5-836c-b29535310588.02e77212-3703-4e8c-90af-f55c232dc4e2.jpg","twitter":"https://twitter.com/bdougieyo","id":"7fb55a54-dbbd-41e5-836c-b29535310588"}],"multipleSpeakers":false},{"id":"205727","title":"Day 1 - Keynote 2","description":"TBA","startsAt":"2020-06-19T21:00:00Z","endsAt":"2020-06-19T22:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":60,"speakers":[{"fullName":"TBA TBA","bio":"TBA","tagLine":"TBA","profilePicture":"https://sessionize.com/image?f=3b71e433b680ee6618cf8c2ec83026a5,400,400,1,0,2a-4204-42f0-9ba8-d7b9c6f67226.585b3f19-716e-4619-b6b1-115646049a6f.png","twitter":null,"id":"2f00c7b5-1f29-4220-94d9-4d7c499899e2"}],"multipleSpeakers":false},{"id":"205728","title":"Day 2 - Keynote","description":"TBA","startsAt":"2020-06-20T16:00:00Z","endsAt":"2020-06-20T17:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":60,"speakers":[{"fullName":"TBA TBA","bio":"TBA","tagLine":"TBA","profilePicture":"https://sessionize.com/image?f=3b71e433b680ee6618cf8c2ec83026a5,400,400,1,0,2a-4204-42f0-9ba8-d7b9c6f67226.585b3f19-716e-4619-b6b1-115646049a6f.png","twitter":null,"id":"2f00c7b5-1f29-4220-94d9-4d7c499899e2"}],"multipleSpeakers":false},{"id":"205729","title":"Day 2 - Townhall","description":"TBA","startsAt":"2020-06-20T17:00:00Z","endsAt":"2020-06-20T18:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":60,"speakers":[{"fullName":"TBA TBA","bio":"TBA","tagLine":"TBA","profilePicture":"https://sessionize.com/image?f=3b71e433b680ee6618cf8c2ec83026a5,400,400,1,0,2a-4204-42f0-9ba8-d7b9c6f67226.585b3f19-716e-4619-b6b1-115646049a6f.png","twitter":null,"id":"2f00c7b5-1f29-4220-94d9-4d7c499899e2"}],"multipleSpeakers":false},{"id":"205468","title":"Innovating on OUR STEM Education","description":"What is an IQ? Why do we take the SATs? How did it end up even being a metric of childhood success? Senior Software Engineer walks through 100 years of modern education and how it has been systematically flawed for underrepresented communities. NSBE Jr. Bay Area takes on this challenge by innovating outside of the parameters of the education system.<br/>","startsAt":"2020-06-20T18:00:00Z","endsAt":"2020-06-20T18:30:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Nate Rose","bio":"Nate Rose is a Senior Software Engineer with a background in DevOps, Data Engineering, and Distributed Cloud Infrastructure Systems. Outside of engineering at Ripple, he does research in neurotechnology, casually overfits ML models and works with building education equity through non-profits like AI4ALL and NSBE.","tagLine":"Senior Software Engineer at Ripple","profilePicture":"https://sessionize.com/image?f=78e72ad517b719b3208c91561f3b0589,400,400,1,0,ac-63a4-463a-8fcb-18114d633994.f4367619-2e8c-4487-b76c-7e2d4aeb9ff0.jpg","twitter":"https://twitter.com/naterose2","id":"bb1610ac-63a4-463a-8fcb-18114d633994"}],"multipleSpeakers":false},{"id":"205473","title":"The future of tech and how to keep in touch while it evolves","description":"It is a fact that technology can be overwhelming when one decides to start his journey. Several people spend years before they can find the right career they fit in to. In this session, we will address how people who find their self in this category can progress while staying up to date with all new technologies. We will briefly mention technologies which are must know and also discuss some resources that people developers can leverage own to upskill.<br/><br/>","startsAt":"2020-06-20T18:00:00Z","endsAt":"2020-06-20T19:00:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":false,"duration":60,"speakers":[{"fullName":"Dawood Iddris","bio":"Dawoodiddris is a software developer, passionately creating products and changing lives with his soft and technical skills by training others in event, workshops and providing platforms for coders to think beyond the limit.","tagLine":"Software & co founder Techloud Inc, Backend Developer  Effect Studios, Microsoft Student Partner ","profilePicture":"https://sessionize.com/image?f=e635a646e1ade36f95027f0e25086b55,400,400,1,0,d6-efce-495f-9cde-97ddcaa425f4.b69d0ee7-1d20-49b2-bfa1-ab8f92a40786.jpg","twitter":null,"id":"7d0172d6-efce-495f-9cde-97ddcaa425f4"}],"multipleSpeakers":false},{"id":"205495","title":"Build JavaScript applications with accessibility in mind","description":"Accessibility is a very important aspect of web development and the goal of this talk is to spread awareness about accessibility and motivate the developers to code with inclusion, diversity, and empathy in mind. This will include practical examples of inaccessible code and how to fix those.<br/><br/>The main topics for discussion will be as follows:<br/><br/>1. A brief introduction of a11y<br/><br/>2. Importance of accessibility<br/><br/>3. Demos and code examples exploring the ways in which JavaScript code can make or break the website accessibility. This will include how to make the functionalities accessible to keyboard users and users of assistive technology.<br/><br/>4. Tools and extensions which can help to write and test accessible applications and websites<br/><br/>The Key takeaways - the audience can apply the concepts learned within their projects/frameworks allowing everyone to write fully accessible and interactive interfaces/websites.","startsAt":"2020-06-20T18:00:00Z","endsAt":"2020-06-20T19:00:00Z","roomId":"14064","language":null,"youtube":null,"isBreak":false,"duration":60,"speakers":[{"fullName":"Anuradha Kumari","bio":"Anuradha is a Tech enthusiast and JavaScript evangelist working as Development Specialist at Mediaocean. She is passionate about exploring new technologies and sharing knowledge through tech articles and talks. She has given local as well as international talks on accessibility. She aims to spread awareness and empower the community towards achieving the common goal of inclusion through technology.","tagLine":"Tech enthusiast and JavaScript evangelist working as Development Specialist at Mediaocean","profilePicture":"https://sessionize.com/image?f=29fd4b553bdef2397f6f520e1aa8d278,400,400,1,0,dc-5176-4117-b441-716cc1d3dce0.1f440560-b5da-49e4-a213-b08488fa4441.jpg","twitter":"https://twitter.com/miracle_404","id":"b33499dc-5176-4117-b441-716cc1d3dce0"}],"multipleSpeakers":false},{"id":"205531","title":"What does culturally responsive teaching mean in an online environment?","description":"Our session will discuss the importance of culturally responsive teaching and the opportunities to amplify the voices of underrepresented youth while teaching in an online environment. <br/>","startsAt":"2020-06-20T18:30:00Z","endsAt":"2020-06-20T19:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Dr. Tressa Matthews","bio":"Dr. Tressa Matthews has been teaching math to middle and high school students for 18 years.  She has a Bachelor's in Industrial and Operations Engineering from the University of Michigan.  After two years in corporate America, she decided to pursue her passion for secondary mathematics.  After earning a Masters and Doctorate in Education, Dr. Matthews co-founded Clever Math to provide online educational services for students and parents.  She has a passion for building supportive classroom environments for African-American students which became the basis for her doctoral research.","tagLine":"Clever Math LLC , Co-Founder","profilePicture":"https://sessionize.com/image?f=da2755bf9e39b6f3db30752fb209d19b,400,400,1,0,4d-9226-4deb-b654-876bbb89d832.244654b5-858d-451b-8f43-2c2c1dbb4562.jpeg","twitter":null,"id":"e0bf324d-9226-4deb-b654-876bbb89d832"},{"fullName":"Dr.  Jennifer Banks","bio":"Jennifer D. Banks, Ph.D. is currently the Mathematics and Science Coordinator for Washtenaw County.  For nearly 20 years, Dr. Banks has served as a teacher and instructional leader at various levels.  Jennifer is passionate about empowering educators and learners, to ensure that all students have equitable access and opportunities to learn and engage in high-quality rigorous mathematics.  Over the past ten years, she has intently worked to expand K-12 educators' understanding of culturally responsive instruction, specifically in the area of mathematics.  Dr. Banks holds a bachelors' Industrial and Operations Engineer and worked in the corporate sector for 4 years.  She has been recognized by various community organizations for her work in expanding access to STEM education, including the Rhonda Walker Foundation and DAPCEP.  She currently serves on the Michigan Early Mathematics Taskforce and is a lecturer for the University of Michigan. Furthermore, she is the Co-Founder of Clever Math, LLC.<br/>","tagLine":"Clever Math, LLC Co-Founder","profilePicture":"https://sessionize.com/image?f=41284bb23c90c0c48853ad5d3a80dc55,400,400,1,0,a499879c-aca4-4752-8910-14b3790846e2.jpg","twitter":null,"id":"e21dc742-0832-4c9f-aeb6-9a1e6e0f8e99"}],"multipleSpeakers":true},{"id":"205624","title":"Autism: from bullying to volunteer and Microsoft MVP","description":"As a child I was bullied a lot. Not everyone accepted me and my autism. I got bullied at school and at work. Due to other adults were bullying me at work and the fact that I am not stress resistant I became sick and had to quit my job. I switched tires and start to investigate how can I use my programming knowledge as a volunteer. Right now I am a Microsoft MVP without a paid job. It’s a talk about how my autism challenged me but most of all how that I anticipated on the challenges and work me up to a world – wide conference speaker and even a Microsoft MVP Developer Technologies since August 1st. ","startsAt":"2020-06-20T20:00:00Z","endsAt":"2020-06-20T20:20:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":20,"speakers":[{"fullName":"Dennie Declercq","bio":"Dennie is Microsoft MVP Developer Technologies and has experience in accessibility in with Microsoft technologies. In daily life Dennie is president and developer at DDSoft, a nonprofit in function of People With Disabilities. Dennie invented technical solutions and systems to help people with disabilities to participate in their daily life. Thanks to his autism he's the right man at the right spot to contribute as a volunteer in function of people with disabilities.","tagLine":"Microsoft MVP || Developer & President DDSoft","profilePicture":"https://sessionize.com/image?f=48c13f3e030fec6503607ec7f6605292,400,400,1,0,8bfc401c-4f95-4a05-b08c-181809cb681f.jpg","twitter":"https://twitter.com/DennieDeclercq","id":"67a075a3-a111-4116-bd44-a25a01485959"}],"multipleSpeakers":false},{"id":"205359","title":"So You Want to Be a Founder?","description":"Learn from my own journey of personal growth as I left Microsoft to co-found a company.  We'll discuss the hardships you can face, how to overcome any struggles, and reflect back on some lessons learned so that you will have a smoother time than I did.","startsAt":"2020-06-20T20:00:00Z","endsAt":"2020-06-20T20:30:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Claudius Mbemba","bio":"Claudius Mbemba was born in Cameroon, Africa to hard-working blue-collar parents who taught him the value of hard work, being a self-starter, and always learning. Immigrating to the US at the age of 7, Claudius saw how technology vastly improved the lives of Americans. It was then his love for technology was born. Following high school, Claudius pursued his Bachelors Degree in Computer Science while on the Varsity Football team at The Ohio State University. Upon completing his degree he accepted employment at Microsoft in Seattle, WA where he worked as a Software Engineer, largely focusing his time on Voice, Mobile, Cloud, Bots, DevOps, ML/AI, & Blockchain. Claudius is currently CTO of Neu Inc, a startup building a marketplace that provides automated hotel-grade turnovers for Airbnb/vacation rentals.<br/><br/>Learn more about Claudius on his website: www.claudiusmbemba.com","tagLine":"CTO @ neu","profilePicture":"https://sessionize.com/image?f=e947ce8b40dbc8bbed9eab6d7f5e3f82,400,400,1,0,4c-07ea-4356-b5b3-29fee8d4b842.a2abfab7-6525-468c-8042-d4df310fab0e.jpg","twitter":"https://twitter.com/mbembaships","id":"ddfecb4c-07ea-4356-b5b3-29fee8d4b842"}],"multipleSpeakers":false},{"id":"205367","title":"Evolving Application Monitoring with the 4 Golden Signals","description":"Traditional monitoring has relied for long time on things like alerting logged exceptions, but this often doesn't tell the whole story. It can lead to many false positives - people getting paged for things that are not customer-impacting issues - as well as false negatives where customer-impacting issues don't result in notifications.<br/><br/>I'll talk about how the 4 Golden Signals can help you raise more actionable alerts, and how this can help drive a tech organization to a more SRE-friendly culture.","startsAt":"2020-06-20T20:20:00Z","endsAt":"2020-06-20T20:40:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":20,"speakers":[{"fullName":"Val Akkapeddi","bio":"I am a engineer and a technical leader that builds great scalable, resilient software and empowered, creative teams. I believe the best outcomes are unlocked when you combine technical insight with a compassionate, nurturing attitude that allows both software and people to excel.<br/><br/>I also believe that if you have a platform, it is your responsibility to use it in the service of justice.","tagLine":"Engineering Team Lead + Observability Geek","profilePicture":"https://sessionize.com/image?f=2a80da9ed6c9eeb7a2c97e224384b991,400,400,1,0,2a-4204-42f0-9ba8-d7b9c6f67226.c3e59364-2710-4f20-abfb-c09919039040.png","twitter":null,"id":"3f1cb337-66f9-41b6-9e0d-ed1305c34ccb"}],"multipleSpeakers":false},{"id":"205541","title":"Keeping pace with what's new in Java 14 and 15","description":"A live coding session that covers new or modified language features in Java 14 and 15 - with a lot of hands-on examples. <br/><br/>Features covered: Sealed Classes and Interfaces, Records, Pattern Matching for instanceof, Text Blocks and Switch Expressions. <br/>","startsAt":"2020-06-20T20:00:00Z","endsAt":"2020-06-20T21:00:00Z","roomId":"14064","language":null,"youtube":null,"isBreak":false,"duration":60,"speakers":[{"fullName":"Mala Gupta","bio":"Mala Gupta is a Developer Advocate at JetBrains. She is also the founder and lead mentor at eJavaGuru.com, Java Champion at Oracle, book author with Manning, Packt, and O'Reilly Publications. <br/><br/>An international speaker at industry conferences, she has experience of 19 years in the software industry. She has been actively supporting Java certification as a path to career advancement. Since 2006, she has been coaching students and professionals to succeed in these certifications. Mala Gupta’s Java books with Manning Publications, USA, are top-rated for Java Certification around the globe. <br/><br/>She co-leads Delhi Java User Group. A strong supporter of Women in Technology, she drives initiatives of Women Who Code - Delhi chapter to augment the participation of women in tech.","tagLine":"Developer Advocate, JetBrains. Author, Speaker. Java Champion.","profilePicture":"https://sessionize.com/image?f=1a454b78844c047fb6ba21e4b46fea4d,400,400,1,0,46272ec8-ed6b-4833-bd76-18bd529bafac.jpg","twitter":null,"id":"16e1da1a-8902-415a-badf-f021d7b888ec"}],"multipleSpeakers":false},{"id":"205471","title":"For Us, Without Us: Addressing Tech’s Shortcomings in Creating Equity for Black People","description":"Many consider technology to be the “great equalizer”, but it’s evident that Black people are not benefiting at the same rates as others. This session will discuss how the forces that limit Black people’s ability to navigate the physical also prevent us from exerting agency via the digital. Together, we’ll discuss the ways that anti-Blackness is replicated in technology, the discrepancies faced by Black communities due to the digital divide, and the changes required for us to have a more equitable future. Because we can never fully benefit if technology continues to be made for us, without us. ","startsAt":"2020-06-20T20:30:00Z","endsAt":"2020-06-20T21:00:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Jacqueline Gibson","bio":"Jacqueline is a Digital Equity Advocate & Software Engineer building change from the code up. She's interested in leveraging technology for social good, particularly identifying ways in which current technology maintains social inequities and working to eliminate these biases. She strives to understand what is necessary to create systems that everyone, regardless of ability, can use with ease.<br/><br/>She graduated with dual degrees in Computer Science and African & African Diaspora Studies from the University of Texas at Austin. She's currently developing tools to create accessible applications for Android, Windows, and web as part of Microsoft's Accessibility Insights team. ","tagLine":"Software Engineer focusing on accessibility at Microsoft","profilePicture":"https://sessionize.com/image?f=baddd8204e89ae7a6d6e97fd2a9fcdbd,400,400,1,0,c7-3ab5-4aef-9d55-3fee6cd0b065.c97d33e6-c1f4-44dd-8f7d-dfcfee0fc6dd.jpg","twitter":null,"id":"1be155c7-3ab5-4aef-9d55-3fee6cd0b065"}],"multipleSpeakers":false},{"id":"205540","title":"Through Programming I became a better Artist","description":"Code is my new favorite artistic medium. Creating art was once the only activity that put me in a flow state that was until I started coding. Programming like art is full of processes, speed bumps, errors, eustress, and joy. My skills as an artist have proven to be an asset in programming. While programming has cultivated artistic improvements. ","startsAt":"2020-06-20T20:40:00Z","endsAt":"2020-06-20T21:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":20,"speakers":[{"fullName":"Shukri Abdullahi N/A","bio":"Shukri Abdullahi is a Self-Taught Programmer and Multi-disciplinary Artist based in New York. ","tagLine":"Programming is an Art Form!","profilePicture":"https://sessionize.com/image?f=c7efcf99eb68d8a56e6d8f59a451657d,400,400,1,0,45ce3c06-8da0-492d-a3d5-bc7baa743be6.jpg","twitter":null,"id":"553cb856-dc47-4bd5-ac1f-234a4f1c1a45"}],"multipleSpeakers":false},{"id":"205545","title":"Session on Intellectual Property rights","description":"My sessions will tackle IP rights of black people in tech.","startsAt":"2020-06-20T21:00:00Z","endsAt":"2020-06-20T21:30:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Mark Okhakumhe","bio":"I am actively building a career in tech & innovation, corporate practice, intellectual property, dispute resolution, and impact investment. Recently, I was a judge at the regional rounds of the Philip Jessup International Law Moot Competition.<br/><br/>I enjoy speaking to people on emerging areas of law, Impact Investment, branding and personal development, startups, and Sustainable Development Goals (SDG), especially SDGs 1, 4, 7, 11 and 16. I am currently working on a podcast called \"Pinstriped\" where I talk about all the above listed.<br/><br/>As a humanitarian, I volunteered to lecture at one of Nigeria's correctional facilities. It was humbling to be part of the story of these inmates who strove to leave the facility better than when they came in. I also volunteered with the Legal Aid Council of Nigeria to take on pro bono cases, and DEVATOP to tackle human trafficking.<br/><br/>I am open to all types of engagements including speaking, volunteer, and full or part-time career opportunities. ","tagLine":"Associat","profilePicture":"https://sessionize.com/image?f=9c6d2b98309fa97d3d572b4ba93d83c1,400,400,1,0,039aad87-041e-4690-8d3e-cfa0ce97662d.jpg","twitter":null,"id":"1db166c2-48fe-4bcb-9990-a76f6f5308ba"}],"multipleSpeakers":false},{"id":"205478","title":"Blackfacts and The Wakanda Technology Platform - Technology By Us/For Us/About Us","description":"Learn about and see demonstrations of cutting edge technologies created to preserve, protect and syndicate historical and current information about the achievements and struggles of Black people, created by a Black software developer who, since the 90s has built systems that put hundreds of businesses, several communities and an entire Caribbean nation online, as well as the Internet's first Black History Encyclopedia, continuously running since 1997.","startsAt":"2020-06-20T21:00:00Z","endsAt":"2020-06-20T21:30:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Ken Granderson","bio":"Ken is a Digital Visionary and Pioneer who launched Blackfacts.com (the Internet's first Black History Encyclopedia) in 1997, put his former community of Roxbury online in 2002, and created the web site for the Caribbean island nation of Saint Lucia in 2013.<br/><br/>His 25-year commitment to build cutting-edge technologies to benefit communities of color has resulted in him building online systems decades ahead of their time, and today the platform he architected for Blackfacts, called the Wakanda Technology Platform, is positioned to become a leading provider of Global Black News and other services, and the only  such platform created by a Black person.<br/><br/>Ken's Digital Archive of news stories, videos and presentations is at http://kengranderson.com","tagLine":"Digital Visionary, Pioneer and Entrepreneur","profilePicture":"https://sessionize.com/image?f=7c96c02fd2fe2c9f1376ba08cfd524c1,400,400,1,0,8f-f092-4da4-bd7c-34b9f15e21bb.5b6a0d79-d75f-4889-b8f1-25b46d55c39f.jpg","twitter":null,"id":"a1c12f8f-f092-4da4-bd7c-34b9f15e21bb"},{"fullName":"Dale Dowdie","bio":"Dale Dowdie founded Intellitech Consulting Enterprises in 1993, the 3rd company he had started since his first company started while still in college. The goal of Intellitech is to provide intelligent technology solutions for business and educational institutions. Over the past 20 years, Intellitech has provided Software Development, Management/IT Consulting, Disaster Recovery/Business Continuity and Consulting Services for organizations, banks and institutions including Liberty Mutual Insurance, Citizens Bank, TJX Companies, Staples and McCormick, to the Government of St. Lucia and Harvard University.<br/><br/>The company has weathered many storms and adjusted its services to meet the ever changing technology demands of the industry. Intellitech continues to grow its customer base in a market that demands effective computing via local/wide-area networking, custom software development database customization, Internet/Intranet services, and systems integration services.<br/><br/>Mr. Dowdie studied computer engineering at Boston University, with a successful track record working for organizations such as the Goddard Space Flight Center(NASA), Lotus Development Corporation, Wang, IBM, and MCI. Over time, that client base evolved to including major banks (Bank of Boston, USTrust, Citizens Bank), Insurance Companies (Liberty Mutual), Healthcare (University Hospitals of Cleveland, Hoffman LaRoche), Biotech (Genzyme) and Retail (Staples, TJ Maxx Companies) organizations. Intellitech has also developed a core vertical market software development team that designs industry specific web/mobile enabled solutions.<br/><br/>One such solution is BARBinc.com. This idea started in 2009 when Mr. Dowdie was frustrated with having to wait when he arrived at his barber for his scheduled appointment. It seemed that his barber had no tools for tracking or managing appointments, nor did he have a web presence. Given Mr. Dowdie’s background, he thought that maybe there was a way that technology could be used to address these issues. However, nothing really progressed with this kernel of an idea until 2011, when Mr Dowdie decided to make the idea a reality.<br/><br/>BARBinc.com was implemented as a Service (created and powered by Intellitech) which would provide Technology solutions for the Hair and Beauty Industry. In the space of a few years, BARBinc.com went from a simple idea to the #1 source of Barbering News and Information on the internet. In 2014, the BARBinc Newswire Service had a following of 19 people and a social media reach of less than 100. By 2017, it had over 50,000 followers and social media reach of over 30 Million. The industry specific services include online and mobile scheduling and shop management, a national directory of barbers/shops/salons/schools, a marketplace to buy and sell industy products, a mobile portal for news, information and event management with more services coming soon. BARBinc.com has customers from the National Association of Barber Boards of America to Bronner Brothers International Hair Show. BARBinc Educators include some of the top Trainers and Educators in the Industry. BARBinc Total Event solutions have been utilized to sell tickets and manage events for some of the biggest hair shows and barber battles in the industry.<br/><br/>Another Solution is BlackFacts.com. Blackfacts is the brain-child of longtime friend and collaborator Ken Granderson, and over the past 20 years it has been running and providing historical facts-of-the-day to our community. Mr. Dowdie was brought in early on to help husband the idea to the next level. However, for years the site remained just a source of black history facts, and in time it grew to be the #1 source for Black Facts on the internet. That all changed in 2017, as Mr. Dowdie and Mr. Granderson finally gave the project the focus it deserved and thus began the process of turning Blackfacts.com from just a historical reference site for Black History into the 'Black Wikipedia' and a showcase of the cultural contributions of people of color and a showcase of the type of technology solutions that can be provided by and to people of color. Those efforts can be seen in this, the latest evolution of BlackFacts.com. There is so much that can be done with the platform, and we hope that you stick around to enjoy the journey with us...<br/><br/>“We are here to alleviate any issue the client is having with new technology, whether that be training, web site development, or networking,” says Mr. Dowdie, who takes pride in understanding the delicate balance of working with people and technology. “Technology may be our future, but people are making the decisions on how it will best benefit their business needs. Our primary focus is to bridge the gap between technology advancement and realistic solutions for companies.”<br/><br/>As a leading edge business based in Boston, MA, Intellitech has a diverse staff of team members with the background and expertise to satisfy clients from around the world. “Human connection is not lost in the Internet, it is only expanded. Our solutions always keep that fact in mind and in the forefront of the minds of our customers.”<br/><br/>Intellitech Website: www.intellitech.net<br/>BARBinc.com Website: www.barbinc.com<br/>BARBinc.com Newswire: news.barbinc.com<br/>Black Facts Website: www.blackfacts.com","tagLine":"Co-Founder/CEO","profilePicture":"https://sessionize.com/image?f=285981226dbb94ee8bec52d4795709d9,400,400,1,0,35f3d344-2391-49cd-8e76-ea63536f774f.jpg","twitter":null,"id":"1c5f2590-bbb4-475f-8b3e-ef5dcf0590bf"}],"multipleSpeakers":true},{"id":"205380","title":"Creating Test Stability To Achieve Continuous Delivery","description":"Our agile teams struggled to continuously merge local code changes to the master repository. In our company, our automated test were taking 30 minutes of execution time and the occurrence of flaky tests was just multiplying this time and reducing the confidence in the results. This slowed our agile teams down tremendously to the point where they couldn’t deliver continuously with automated pipelines. Ensuring high quality for each iteration became a challenge for our agile teams as they had to wait for my analysis of the failing tests. We had created automated checks to make our testing more efficient, but instead they were slowing us down and causing bottlenecks - I was a bottleneck.<br/><br/>Our automated tests were maintained by various team members and some of them were not following leading practices - which led to flaky results due to such things as - concurrency relying on non-deterministic behaviour, caching, dynamic content and many other factors. I needed to find out the root causes. I started my investigation and found the common issues were because of environment, locators, coding practices and a lack of knowledge sharing and code reviews. I improved our locators, coding practices, debugging and simultaneously the developers helped us to fix all environment issue and slow page load times, it was a long journey but it was definitely worth it.<br/><br/>Currently our automated test suites takes just 5 minutes to run in our CI environment - a huge improvement! Now my team members are more encouraged to see why a test is failing because the majority of failures now are genuine, and are providing valuable information. As a team, we get to spend more time testing and creating new automated tests, which has resulted in finding more bugs. We’ve also put things in places to avoid ending up in a flaky nightmare again, such as a Wiki Page of leading practices.I’m no longer a bottleneck, the team works together to maintain fast valuable automated tests, and I want to share the insights from that journey with you.<br/><br/>After this session, you’ll learn techniques to: 1. Treat test code as production code and test environments as production environments 2. Improve the stability of your tests which in turn improves your continuous delivery pipeline 3. Make tests faster to enable fast feedback","startsAt":"2020-06-20T21:00:00Z","endsAt":"2020-06-20T21:30:00Z","roomId":"14064","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Trisha Chetani","bio":"I am an automation enthusiast. I have seven years of experience in the software testing space. I have enjoyed being a software tester, helping the team to follow testing processes and support that enable teams to deliver high-quality software in DevOps Environment. I have worked on manual & automation (Front-End & Rest APIs). I'm always enthusiastic to attend Conference meetups for professional development.","tagLine":"Software Tester","profilePicture":"https://sessionize.com/image?f=907bbf86058be9ed7c15c571f0f3af35,400,400,1,0,b3-f922-4b4e-8bc5-ed133b247e9d.344ff1a2-c12a-4cae-94ed-6bbe07e8176f.jpg","twitter":"https://twitter.com/trisha_1212","id":"635bf7b3-f922-4b4e-8bc5-ed133b247e9d"}],"multipleSpeakers":false},{"id":"205462","title":"Grimoire: A Data Centric Blogging Platform","description":"In this talk, I will describe how I built a new blogging platform focused on creating interactive data stories. By the end, you will understand the tools and techniques used to build a serverless first platform and a new place to communicate with data.  ","startsAt":"2020-06-20T21:30:00Z","endsAt":"2020-06-20T22:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Banjo Obayomi","bio":"Banjo is a Senior Research Engineer at Two Six Labs, where he develops platform solutions for productizing various researched-based projects. Banjo is passionate about operationalizing data aka DataOps and has started a podcast and meetup around data.","tagLine":"DataOps Mindset, Full Stack Background, Can't Lose","profilePicture":"https://sessionize.com/image?f=37ed47d9e5ff657e4a56fb01f42f5956,400,400,1,0,9e-603f-4ed6-965b-9dad8885ccc9.97ff5546-0362-4bf0-9c7f-61820e52cd31.png","twitter":null,"id":"7b8e269e-603f-4ed6-965b-9dad8885ccc9"}],"multipleSpeakers":false},{"id":"205365","title":"Why You're Not Landing That UX Role","description":"As a UX Coach, the question I am asked the most is \"How do I actually land that UX role?\". While the question is broad, I've identified a few areas where aspiring UX Designers really struggle getting their foot in the door at companies of their choice. In my talk, attendees will walk away being able to not only identify their key problem areas, but have action items around overcoming those obstacles to land their dream role. ","startsAt":"2020-06-20T21:30:00Z","endsAt":"2020-06-20T22:00:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Ashley Janelle","bio":"<br/>As a seasoned User Experience and User Interface Designer, Ashley Janelle focuses on designing customer centered experiences that target her users everyday challenges. At Caterpillar Inc., Ashley taps into user needs while designing solutions that allow them to save time, money, and increase their productivity. <br/><br/>As a UX coach and course creator, she’s developed an online course, “Learn UX Online in 16 Weeks” to help aspiring UX designers go from beginner to experienced UX Designers to land jobs at top companies. Using her UX expertise and passion for working with people, Ashley’s not only helped others land their dream roles, but build the confidence to become successful UX Designers. ","tagLine":"UX/UI Designer & UX Coach","profilePicture":"https://sessionize.com/image?f=f4492dfa93616943dd5be87da9af2841,400,400,1,0,687ae03f-126e-48ef-be9b-9116c2016941.jpg","twitter":null,"id":"a3e0e5a9-3980-4234-9fa2-fca935b3ba9f"}],"multipleSpeakers":false},{"id":"205422","title":"The Technology and Psychology of Refactoring","description":"When the requirements change out from under your tech team, your code has to change. So it’s worthwhile to build your skills in assessing code maintainability, deciding whether to refactor, and doing the refactor.<br/><br/>In this talk, we’ll answer questions like:<br/><br/>What does it mean for code to be maintainable, and how do we make code more maintainable?<br/>How do we know when to refactor—and how do we know when to stop refactoring?<br/>How do we sell stakeholders on giving us space to make a large refactor?<br/>This talk includes both code samples and architecture samples from apps in use today.","startsAt":"2020-06-20T21:30:00Z","endsAt":"2020-06-20T22:00:00Z","roomId":"14064","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Chelsea Troy","bio":"Chelsea writes code on projects like the Zooniverse Citizen Science Mobile App and the NASA Landsat Image Processing Pipeline. She looks for clients who are saving the planet, advancing basic scientific research, or providing resources to underserved communities. She has been known to take projects in mobile development, web development, and machine learning. She streams some programming sessions to YouTube, so you can watch her code (and narrate!) in real time. She then turns the recordings into educational materials.<br/><br/>Chelsea also teaches Mobile Software Development at the Master’s Program in Computer Science at the University of Chicago. She is the author of chelseatroy.com and a book called Remote Work Sucks (the title is kind of a trap). She organizes two conferences: PromptConf (Chicago area, very technical) and ORD Camp (Chicago area, not nearly as technical).<br/><br/>Chelsea flings barbells around for fun. She drives an electric cafe cruiser named Gigi. She's very gay.<br/><br/>*Note on speaker photo: I'm not sure mine uploaded correctly but it is available at the bottom of chelseatroy.com/speaking, feel free to steal it from there :)","tagLine":"I write code for money, fling barbells for fun, and write about tech for jack diddly at chelseatroy.com.","profilePicture":"https://sessionize.com/image?f=b92dace81787511359bc063f29597e77,400,400,1,0,cf-8bc4-4aca-8181-dbd4a2aeac90.62b31710-14e5-4cfb-9dce-6ceb5676d6a1.jpg","twitter":null,"id":"e3d878cf-8bc4-4aca-8181-dbd4a2aeac90"}],"multipleSpeakers":false}],"Days":[{"generic":{"eventStartsAt":"2020-06-19T16:00:00Z","eventEndsAt":"2020-06-19T22:00:00Z"},"track1":{"id":5566,"title":"Track 1","talks":[{"id":"205726","title":"Day 1 - Keynote 1","description":"TBA","startsAt":"2020-06-19T16:00:00Z","endsAt":"2020-06-19T17:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":60,"speakers":[{"fullName":"TBA TBA","bio":"TBA","tagLine":"TBA","profilePicture":"https://sessionize.com/image?f=3b71e433b680ee6618cf8c2ec83026a5,400,400,1,0,2a-4204-42f0-9ba8-d7b9c6f67226.585b3f19-716e-4619-b6b1-115646049a6f.png","twitter":null,"id":"2f00c7b5-1f29-4220-94d9-4d7c499899e2"}],"multipleSpeakers":false},{"id":"205452","title":"Combatting Bias in Machine Learning","description":"In this talk I cover how to see the bias in your data and machine learning models. By giving examples from recent research on biased facial recognition systems as well as cutting edge explainability algorithms, attendees can expect clarification on what bias means in machine learning.","startsAt":"2020-06-19T17:00:00Z","endsAt":"2020-06-19T17:30:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Ayodele Odubela","bio":"Ayodele Odubela is a Data Scientist working on driver risk mitigation at SambaSafety in Denver, CO. Previously she earned her Master's degree in Data Science after transitioning to tech from social media marketing. She's created algorithms that predict consumer segment movement, goals in hockey, and the location of firearms using radio frequency sensors. ","tagLine":"Data Scientist at SambaSafety","profilePicture":"https://sessionize.com/image?f=bb5c451a1ca33549ff77eb81c90601d6,400,400,1,0,a7-e484-40e8-8e70-f62435aca9fd.0ea2f563-04c6-476a-9f79-5a5e4a8ef681.png","twitter":"http://www.twitter.com/ayodeleohh","id":"2a59bea7-e484-40e8-8e70-f62435aca9fd"}],"multipleSpeakers":false},{"id":"205477","title":"Empowered by Imposter Syndrome","description":"Imposter syndrome is something that the industry continues to represent as a negative. My take on this as a black woman in tech is we need to turn all of our disadvantages into growth opportunities. Adding structure to our learning path is the best way of removing the negative image of feeling like an imposter and allows us to flourish.","startsAt":"2020-06-19T17:30:00Z","endsAt":"2020-06-19T18:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"valerie sharp","bio":"Valerie Sharp is a Founder & CEO at Tech By Choice and a Senior Software Engineer at Mastery Logistics. She holds a BS in Psychology & Art. Valerie is passionate about creating secure human-centered digital experiences. As a successful self-taught developer, Valerie started Tech By Choice to give back to the community that helped her succeed.","tagLine":"Founder & CEO of Tech By Choice","profilePicture":"https://sessionize.com/image?f=5e531b9f3095c9c624b2ab7dcfff2c5a,400,400,1,0,2a-4204-42f0-9ba8-d7b9c6f67226.c9b06da4-8cb4-46fc-a087-a7207a204e81.png","twitter":null,"id":"71fee9c9-b6b5-42a6-a6e5-18b825681c3f"}],"multipleSpeakers":false},{"id":"205543","title":"Empowerment to the People!  What You Need to Know about Black People, Disability, and Accessibility","description":"About one fifth (20%) of the global population lives with disabilities.​ According to the 2017 American Community Survey, 13.6 percent of Black and African Americans have a disability. Further, the unemployment rate for people with disabilities is almost double of other people, and the people with disabilities who are employed have lower earnings, in general. This means we have an opportunity and a duty to empower Black people with technology. One of the most powerful ways we can do this is to make messaging and technology accessible.<br/><br/>While many of us have heard that accessibility is important, we seldom hear about how to implement it in our everyday work. Angela will discuss how people in every discipline can do so and further amplify the voices of Black people.","startsAt":"2020-06-19T18:00:00Z","endsAt":"2020-06-19T19:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":60,"speakers":[{"fullName":"Angela Hooker","bio":"Angela Hooker is a Senior Accessibility Product Manager at Microsoft, where she's built a center of expertise for accessibility, user experience, and universal design. She's brought her web management, development, design, accessibility, and editorial and content management expertise to the government and private sector for over 20 years. Angela also advocates for role-based accessibility and believes that teaching people how to incorporate principles of accessibility in their everyday work creates a sustainable program and produces the most accessible user experiences. Angela speaks on and writes about accessibility, disability, user experience, and plain language.","tagLine":"@AccessForAll","profilePicture":"https://sessionize.com/image?f=9854c3f5f97b02caa8997f42e02de101,400,400,1,0,2a-4204-42f0-9ba8-d7b9c6f67226.355e98e5-89fd-442d-b2b5-a066a99cdfb7.png","twitter":null,"id":"f2f7fe26-aa6c-4e2e-96c8-2ecfa8c07a99"}],"multipleSpeakers":false},{"id":"205425","title":"Black Queer Living: a history of DIY culture in the Black LBGT+ community","description":"What is DIY culture? How does DIY culture intertwine with the Black LGBT+ culture? Get these questions answered, and learn a few easy beginner DIY tutorials to do on t-shirts! No previous experience required!","startsAt":"2020-06-19T19:00:00Z","endsAt":"2020-06-19T20:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":60,"speakers":[{"fullName":"Harold Jackson N/A","bio":"Harold studied computer science at the University of Texas at Austin. He's started Black Queer Living, a youtube channel dedicated to teaching life skills 101, centering queer and trans* people of color: https://www.youtube.com/channel/UCx3ihWKRcPrTDdhk87M2yeg","tagLine":"Bandana Montana","profilePicture":"https://sessionize.com/image?f=c0abbcd5b636ace581c6a672b961736b,400,400,1,0,69-bc29-4570-824e-31ed1601338e.3cf61c49-4630-412c-a5ef-4cf8095f3593.jpg","twitter":null,"id":"7e8f2669-bc29-4570-824e-31ed1601338e"}],"multipleSpeakers":false},{"id":"205460","title":"Journaling as a Dev","description":"Are you working with impact and purpose? Are you solidly attuned on what you're doing month-to-month with your role? How difficult is it for you to track your accomplishments at work? If any of these questions lead to uncertain answers, then you should learn what it means to journal professionally as a dev. This talk will cover my exploration into journaling and its application to tracking my goals and progress as a software engineer. I will discuss how to set up your journal for any goals and how to score on your performance review!","startsAt":"2020-06-19T20:00:00Z","endsAt":"2020-06-19T20:30:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Brittney Braxton","bio":"Brittney is a software engineer who loves a good cup of tea. In her spare time, she draws illustrations for teaNotes.dev on Instagram. Brittney strives to connect with folks who geek out over code with hopes to contribute to a friendly and inviting tech community.","tagLine":"Software Engineer ","profilePicture":"https://sessionize.com/image?f=f251e2b3e22564e038984f82ae042ebb,400,400,1,0,66-4f67-4eeb-b00b-816f3b5821e7.15a28eab-ec6e-4921-88fa-dba2621b28e5.jpeg","twitter":null,"id":"98b26966-4f67-4eeb-b00b-816f3b5821e7"}],"multipleSpeakers":false},{"id":"205536","title":"Giving Back to Tech without Burnout","description":"Giving Back to Tech without Burnout<br/>You did it! You’re a Software Engineer! After many hours of studying and learning difficult concepts, you made it through. Now you want to volunteer and give back your tech skills to a needed cause.  Exciting, right?  Wait…here’s a few tips to avoid giver burnout before you start.","startsAt":"2020-06-19T20:30:00Z","endsAt":"2020-06-19T21:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Mo Hampton","bio":"Mo Hampton is a Software Engineer at GDIT. Her passion for web application development led her to the Open Source community to learn full-stack JavaScript. When not thriving off of coffee, meditation or travel, she builds cost-effective, user-friendly business applications.","tagLine":"Software Engineer @ General Dynamics IT","profilePicture":"https://sessionize.com/image?f=23c06d3c405fc2f4628267b8e688a458,400,400,1,0,2f-0e9e-4181-8a9d-bff10f1161a2.4dc3907d-d3f7-4f6c-be5b-45735f54d617.jpeg","twitter":null,"id":"cf6f0e2f-0e9e-4181-8a9d-bff10f1161a2"}],"multipleSpeakers":false},{"id":"205727","title":"Day 1 - Keynote 2","description":"TBA","startsAt":"2020-06-19T21:00:00Z","endsAt":"2020-06-19T22:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":60,"speakers":[{"fullName":"TBA TBA","bio":"TBA","tagLine":"TBA","profilePicture":"https://sessionize.com/image?f=3b71e433b680ee6618cf8c2ec83026a5,400,400,1,0,2a-4204-42f0-9ba8-d7b9c6f67226.585b3f19-716e-4619-b6b1-115646049a6f.png","twitter":null,"id":"2f00c7b5-1f29-4220-94d9-4d7c499899e2"}],"multipleSpeakers":false}]},"track2":{"id":8856,"title":"Track 2","talks":[{"id":"5b26a6fb-89c6-4923-8c88-70c6ae4e6060","title":"Break","description":"Generated break","startsAt":"2020-06-19T16:00:00Z","endsAt":"2020-06-19T17:00:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":true,"duration":60,"speakers":[],"multipleSpeakers":false},{"id":"205366","title":"The Ideal Community Model: Lessons Learned","description":"There are many ways to push your career to a point it takes a great turn, but I found out in 2017 that community participation is a must. Community involvement can be anything from Open Source Contributions, Writing articles, answering questions on social media/StackOverflow to speaking at conferences. Participation in your community will expand your network. <br/><br/>By attending small meetups or having conversations in slack channels will lead you to meet new people in your industry. Sharing will increase your visibility in the ecosystem by Founders, people of related skill sets, recruiters, and more. <br/><br/>There isn’t just one way to share your expertise with your community. Open Source Contributions isn't just code, you can write articles/documentation about the product you would like to contribute to about your experiences or speak at conferences. Collaboration helps you to be seen as a leader in your community. You can collaborate with others in your network by mentoring, organizing an event, or working together on a personal project/ideas<br/><br/>I learned most of the things I know today about the community the hard way because I never saw it as anything important, and all I cared about was just write the code and today I am a Senior Developer Advocate at Fleek,  and also the lead organizer of some major communities in Africa which included, unStack, Developers Circles Lagos from Facebook, Open Source Community Africa, NaijaHacks, and AfricaHacks.<br/><br/>Key Takeaways:<br/><br/>1) They will understand how to get started with contributing to a community as a person<br/>2) They will understand why to contribute to a community<br/>3) They will learn how to build a community on their own<br/>4) They will learn how to find a community that is just like you wherever you are<br/>5) They will learn how open-source works in a community<br/>6) They will learn how to contribute to ideas in the community <br/>7) Most of all, They will learn how to add and receive value from a community","startsAt":"2020-06-19T17:00:00Z","endsAt":"2020-06-19T17:30:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Shodipo Ayomide","bio":"Shodipo Ayomide is a Developer Advocate, Engineer, and Occasional Designer, who also contributes to a lot of open-source projects over on GitHub, he also runs some major communities like unStack, Developers Circles Lagos from Facebook, Open Source Community Africa and NaijaHacks driving Nigeria & Africa forward in Technology, he is an international speaker who has spoken at a lot of conferences over time in various locations, in his free time he loves to, Read, See a Movie and Occasionally play video games, Loves Travelling and Family.<br/>","tagLine":"Senior Developer Advocate at Fleek","profilePicture":"https://sessionize.com/image?f=620438df2143939ff9c4103d63952deb,400,400,1,0,18-b136-4f7e-9db8-32ffcdebfa26.4dd1567c-3ca5-4f41-a914-7f1c7bbacf8a.jpg","twitter":"http://www.twitter.com/developerayo","id":"999f5218-b136-4f7e-9db8-32ffcdebfa26"}],"multipleSpeakers":false},{"id":"205535","title":"Breaking into Tech: From the Trenches","description":"This talk will share my personal obstacles from a non-traditional career path (Veteran, women of color, mother and coding bootcamp graduate) to a Software Engineer. ","startsAt":"2020-06-19T17:30:00Z","endsAt":"2020-06-19T18:00:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Mo Hampton","bio":"Mo Hampton is a Software Engineer at GDIT. Her passion for web application development led her to the Open Source community to learn full-stack JavaScript. When not thriving off of coffee, meditation or travel, she builds cost-effective, user-friendly business applications.","tagLine":"Software Engineer @ General Dynamics IT","profilePicture":"https://sessionize.com/image?f=23c06d3c405fc2f4628267b8e688a458,400,400,1,0,2f-0e9e-4181-8a9d-bff10f1161a2.4dc3907d-d3f7-4f6c-be5b-45735f54d617.jpeg","twitter":null,"id":"cf6f0e2f-0e9e-4181-8a9d-bff10f1161a2"}],"multipleSpeakers":false},{"id":"205542","title":"Your Startup: How to Launch, Capitalize and Win - Against All Odds","description":"This is a 50-minute presentation (+10 minutes for Q&A) with the goal of providing much-needed information on how to plan a startup, launch and raise capital. I will also intersperse the presentation with examples from my real-life experience of launching a robotic service company as well as experience gained from several other successful startups that I was fortunate to join on their respective journeys.","startsAt":"2020-06-19T18:00:00Z","endsAt":"2020-06-19T19:00:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":false,"duration":60,"speakers":[{"fullName":"Jeff Debrosse","bio":"Jeff Debrosse is a technology and cybersecurity industry veteran and is currently the founder and principal at Sympler where he runs the company's daily operations around designing and building core security architectures, contact-tracing solutions for COV!D-19 and robotics solutions. Prior to founding Sympler, Jeff was the Chief Technology Officer for Adaptive Motion Group where he led development on the navigation and security architectures of AMG’s autonomous systems. Jeff also founded and led NXT Robotics from 2014-2017. In his role as CEO, Jeff raised the company’s seed round of funding and as CTO he designed and built the security, vision, navigation and sensor integration frameworks. <br/><br/>Jeff also led the cybersecurity, R&D and product development teams at Websense (acquired by Vista Equity Partners), ESET LLC. and Ntrepid Corporation. He also worked on classified projects for the intelligence community where he created and deployed increasingly effective and sophisticated cybersecurity solutions across a broad spectrum of requirements. Jeff has spoken at leading conferences such as Gartner, RSA, BlackHat, defCon and other events across the globe. Jeff has a BS in IT Management and he is currently an adjunct faculty member of San Diego State University’s (SDSU) Homeland Security Program.  <br/>","tagLine":"Principal, Sympler LLC","profilePicture":"https://sessionize.com/image?f=827a2cafdf02a14ed94f413d35635472,400,400,1,0,38-15e3-4791-bb45-def422b9d0f3.9d2aff89-acdc-427a-a30b-00558d34fe4a.jpg","twitter":null,"id":"4d09a438-15e3-4791-bb45-def422b9d0f3"}],"multipleSpeakers":false},{"id":"8b53d1f0-7c24-4914-a7b5-9d7f62208963","title":"Break","description":"Generated break","startsAt":"2020-06-19T19:00:00Z","endsAt":"2020-06-19T20:00:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":true,"duration":60,"speakers":[],"multipleSpeakers":false},{"id":"205360","title":"What they don't teach you about fundraising as a Black Founder","description":"Practical advice and lessons learned from Neu's failed fundraising attempts.","startsAt":"2020-06-19T20:00:00Z","endsAt":"2020-06-19T20:30:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Claudius Mbemba","bio":"Claudius Mbemba was born in Cameroon, Africa to hard-working blue-collar parents who taught him the value of hard work, being a self-starter, and always learning. Immigrating to the US at the age of 7, Claudius saw how technology vastly improved the lives of Americans. It was then his love for technology was born. Following high school, Claudius pursued his Bachelors Degree in Computer Science while on the Varsity Football team at The Ohio State University. Upon completing his degree he accepted employment at Microsoft in Seattle, WA where he worked as a Software Engineer, largely focusing his time on Voice, Mobile, Cloud, Bots, DevOps, ML/AI, & Blockchain. Claudius is currently CTO of Neu Inc, a startup building a marketplace that provides automated hotel-grade turnovers for Airbnb/vacation rentals.<br/><br/>Learn more about Claudius on his website: www.claudiusmbemba.com","tagLine":"CTO @ neu","profilePicture":"https://sessionize.com/image?f=e947ce8b40dbc8bbed9eab6d7f5e3f82,400,400,1,0,4c-07ea-4356-b5b3-29fee8d4b842.a2abfab7-6525-468c-8042-d4df310fab0e.jpg","twitter":"https://twitter.com/mbembaships","id":"ddfecb4c-07ea-4356-b5b3-29fee8d4b842"}],"multipleSpeakers":false},{"id":"205479","title":"Navigating from Rejections","description":"This session is aimed at providing tangible ways to navigate rejections and failures, learning from the situation, building resilience muscle, and finding positivity in moving ahead for future while keeping our head high and our mental wellbeing in check. ","startsAt":"2020-06-19T20:30:00Z","endsAt":"2020-06-19T21:00:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Harpreet Kaur","bio":"Harpreet Kaur is an engineer, public speaker, and an artist. She is a Senior Global Technical Program manager at Microsoft – Cloud and AI with proven track record of leading business and<br/>digital transformation and shipping high quality products/solutions that increase productivity,<br/>standardization/simplification of the enterprise tools, processes and resources. She brings 16+ yrs. of Product, Program, People and Change Management expertise with strategic leadership<br/>experience in multiple industry domains. She believes the rejections on her career journey have shaped her as a strong resilient leader and helped her redefine her professional goals.<br/>Harpreet Kaur holds Master of Computer Applications and is also PMP, CSPO and Prosci Change Practitioner. ","tagLine":"Microsoft - Senior Technical Program Manager","profilePicture":"https://sessionize.com/image?f=8d0f3e84f2e1f979f44a18a297b5ed9d,400,400,1,0,f2-af00-4131-9dbb-5245d5f62f22.c0fae1c8-2b0b-4858-a777-387a8732a498.jpg","twitter":null,"id":"c2e621f2-af00-4131-9dbb-5245d5f62f22"}],"multipleSpeakers":false},{"id":"af398525-29c1-4506-a888-bcc365174143","title":"Break","description":"Generated break","startsAt":"2020-06-19T21:00:00Z","endsAt":"2020-06-19T22:00:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":true,"duration":60,"speakers":[],"multipleSpeakers":false}]},"track3":{"id":1782,"title":"Track 3","talks":[{"id":"8b5ae94f-867f-487f-aeaf-8bdf2bd9ca48","title":"Break","description":"Generated break","startsAt":"2020-06-19T16:00:00Z","endsAt":"2020-06-19T17:00:00Z","roomId":"14064","language":null,"youtube":null,"isBreak":true,"duration":60,"speakers":[],"multipleSpeakers":false},{"id":"205532","title":"Why teenagers should learn JavaScript","description":"I am Kumar Abhirup, a 16 year old from India. I am here to share my journey of how a school-hating kid can start to love his own life! Programming is not a child's play, you think?? Think again. ","startsAt":"2020-06-19T17:00:00Z","endsAt":"2020-06-19T17:20:00Z","roomId":"14064","language":null,"youtube":null,"isBreak":false,"duration":20,"speakers":[{"fullName":"Kumar Abhirup","bio":"I am 16-year-old JavaScript React Developer from India who builds cool projects since 2018. I am specialized in building full-stack applications that use React in frontend and GraphQL in the backend. I am in the evergreen process of learning, and I am loving it! I am also a 10th grader!<br/><br/>GitHub: https://github.com/KumarAbhirup<br/>Website: https://kumarabhirup.me<br/>Twitter: @kumar_abhirup<br/>DEV: https://dev.to/kumar_abhirup<br/>Medium: https://medium.com/@kumar_abhirup<br/>LinkedIn: https://linkedin.com/in/kumar-abhirup/<br/><br/>❤️ Node.js and React.js","tagLine":"16yo JavaScript Developer","profilePicture":"https://sessionize.com/image?f=e463b1d45c655cf28cbf1eb18bb2b7fd,400,400,1,0,199503f0-02f1-4589-8eb3-f63284c558cf.jpg","twitter":null,"id":"6212c3ca-b2f3-4aae-bcc1-e158a0c73563"}],"multipleSpeakers":false},{"id":"205534","title":"Finding Fish Schools with Artificial Intelligence","description":"As a young Mexican scientist it is hard to be admitted as a solid researcher by peers when you are working on a innovative field. Firstly because you are young and secondly because you are not from a tech top tier country.  ","startsAt":"2020-06-19T17:20:00Z","endsAt":"2020-06-19T17:40:00Z","roomId":"14064","language":null,"youtube":null,"isBreak":false,"duration":20,"speakers":[{"fullName":"Miguel Reynaga","bio":"Biologist from Metropolitan Autonomous University, MS in Sustainable Societies. Twice awarded with the Academic Excellence Scholarship by the Secretariat of Public Education of Mexico and 1st place of the XVII Best Research Experience Award, Dr. Ramon Villarreal 2016 by the National Association of Universities and Higher Education Institutions of Mexico. ","tagLine":"MiguelReynaga.com ","profilePicture":"https://sessionize.com/image?f=564c28d17d06e52fbce94fc5351ca0ad,400,400,1,0,e3-b3a0-48dd-bb31-720c761f5065.3f35492b-636d-417c-b2be-09345a33cce5.jpeg","twitter":null,"id":"808f2be3-b3a0-48dd-bb31-720c761f5065"}],"multipleSpeakers":false},{"id":"205485","title":"Terraform, the de facto infrastructure as code for cloud service provisioning","description":"Terraform is an amazing toolset for automating infrastructure in the public and private cloud. This session will teach you the fundamentals of Terraform to deploy infrastructure in a consistent, repeatable manner across multiple services.","startsAt":"2020-06-19T17:40:00Z","endsAt":"2020-06-19T18:00:00Z","roomId":"14064","language":null,"youtube":null,"isBreak":false,"duration":20,"speakers":[{"fullName":"Devlin Duldulao","bio":"Devlin Duldulao is a Filipino full-stack cloud engineer based in Norway. He is a Microsoft MVP, an Auth0 Ambassador, a trainer, an international conference speaker, and a senior consultant at Inmeta. He loves going to universities and user groups to share his expertise.","tagLine":"Microsoft MVP, Senior Consultant at Inmeta","profilePicture":"https://sessionize.com/image?f=dce5e2a4caf000389171617f51cce034,400,400,1,0,53378d1f-064c-46f3-bef3-af4e3301127d.jpg","twitter":"https://twitter.com/DevlinDuldulao","id":"ca350f30-7945-4b1c-8a23-663346e39e88"}],"multipleSpeakers":false},{"id":"205515","title":"Is Headless CMS the future of development?","description":"As digital products continue to evolve, so does the content we consume. A scalable, cross-platform content management system is crucial to ensuring a product’s growth velocity. Traditional CMS gives the comfort of having the content, the editing interface, templates, and custom codes, in a single environment. But with the changes in this mobile era, that’s no longer enough. We need a new breed of CMS — one that can make content available through any channel at which point a Headless CMS is required.<br/><br/>Headless CMS, is a backend-only content management system that allows developers to create, store, manage, and publish the content over an API. It gives developers the power to quickly build excellent user experiences, free from the worry of its impact on the back-end business logic.","startsAt":"2020-06-19T18:00:00Z","endsAt":"2020-06-19T18:30:00Z","roomId":"14064","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Blessing Krofegha","bio":"Blessing Krofegha is a dynamic Software Engineer with a drive to create marketable solutions to global businesses.<br/>He is also a Technical author at Smashing Magazine and LogRocket.","tagLine":"Software Engineer and Technical Writer","profilePicture":"https://sessionize.com/image?f=01d8ca60e7f0df20616065f7803864eb,400,400,1,0,5abc3869-8f65-4dc1-bbbd-54fa1d23a14a.jpg","twitter":"https://twitter.com/beveloper","id":"0ea35f5e-57cc-4f9f-8854-40e1b533ff8c"}],"multipleSpeakers":false},{"id":"205281","title":"Electronic Tales's session","description":"We want to talk about our community project, Electronic Tales, which will be based on a learning platform aimed at junior developers. By showing our project, we will discuss topics such as what is computer culture, normativity in IT and the toxic myth of \"the super geek\". Our goal is to create a \"coding safe space\": a space where junior developers feel included and free to share their insecurities, tips and knowledge.<br/><br/>IMPORTANT : this talk has already been given once @ the QueerJS meet up (may 2020).","startsAt":"2020-06-19T18:30:00Z","endsAt":"2020-06-19T19:00:00Z","roomId":"14064","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Elisabeth Fainstein","bio":"I am a french fullstak web developer (Java/JS) since 2017. I am also a web dev instructor. I am queer and feminist. ","tagLine":"Cofounder of Electronic Tales (electronictales.io)","profilePicture":"https://sessionize.com/image?f=0ce4004af5cc464dce0caff6a0826938,400,400,1,0,c7-3b87-4495-9939-0938d3a56f2a.68635ce8-0ad0-43b4-8913-d802bbea7366.png","twitter":null,"id":"52324ac7-3b87-4495-9939-0938d3a56f2a"}],"multipleSpeakers":false},{"id":"3dd9c6ac-4497-4fa6-a214-3157da0711d5","title":"Break","description":"Generated break","startsAt":"2020-06-19T19:00:00Z","endsAt":"2020-06-19T20:00:00Z","roomId":"14064","language":null,"youtube":null,"isBreak":true,"duration":60,"speakers":[],"multipleSpeakers":false},{"id":"205450","title":"Testing in Production","description":"How do you know your feature is working perfectly in production? If something breaks in production, how will you know? Will you wait for a user to report it to you? What do you do when your staging test results do not reflect current production behavior? In order to test proactively as opposed to reactively, try testing in production! You will have an increased accuracy of test results, your tests will run faster due to elimination of bad data, and you will have higher confidence before releases. This can be accomplished through feature flagging, canary releases, setting up a proper CI/CD pipeline, and data cleanup. You will leave this talk with strategies to mitigate risk, to better your understanding of the steps to get there, and to shift your company’s testing culture, so you can provide the best possible experience to your users. At the end of the day, we don't care if your features work in staging, we care if they work in production. <br/>","startsAt":"2020-06-19T20:00:00Z","endsAt":"2020-06-19T20:30:00Z","roomId":"14064","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Talia Nassi","bio":"Talia Nassi is an international keynote speaker who delivers content on all things testing and quality. She is a developer advocate at Split.io where she works closely with engineering teams globally to ship software more efficiently. She is passionate about feature flagging, canary launches, CI/CD, testing in production, and A/B testing. She has spoken at countless conferences internationally, ranging from audiences of 100 to 2000!","tagLine":"Developer Advocate @ Split","profilePicture":"https://sessionize.com/image?f=3dfbedfe98cc16be27cec5ca2344a038,400,400,1,0,177484a6-7de7-4380-8e5e-2d234b94a094.jpg","twitter":"https://twitter.com/talia_nassi","id":"c8519301-f2c9-4240-bd97-7de34f122d29"}],"multipleSpeakers":false},{"id":"205428","title":"Your next open source contribution","description":"Today Open Source is ubiquitous and comprises nearly 80% – 90% of the code in a “typical” application. There is a need to use Open Source to stay competitive, but what about the need to use open source to advance your career?<br/><br/>In this talk, I will talk through actionable ways to make open-source contributions to grow your career.","startsAt":"2020-06-19T20:30:00Z","endsAt":"2020-06-19T21:00:00Z","roomId":"14064","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Brian Douglas","bio":"Brian Douglas is a Developer Advocate at GitHub where he works on increasing use of the GitHub API by iterating on the onboarding process and helping users with evergreen technical content.","tagLine":"GitHub Developer Advocate","profilePicture":"https://sessionize.com/image?f=a20f286b686099b2c552beb6055edd7c,400,400,1,0,54-dbbd-41e5-836c-b29535310588.02e77212-3703-4e8c-90af-f55c232dc4e2.jpg","twitter":"https://twitter.com/bdougieyo","id":"7fb55a54-dbbd-41e5-836c-b29535310588"}],"multipleSpeakers":false},{"id":"34cd6262-e593-4ffa-99e5-6012aa648ba5","title":"Break","description":"Generated break","startsAt":"2020-06-19T21:00:00Z","endsAt":"2020-06-19T22:00:00Z","roomId":"14064","language":null,"youtube":null,"isBreak":true,"duration":60,"speakers":[],"multipleSpeakers":false}]},"track4":{"id":0,"title":null,"talks":[]},"sessions":null,"id":7323,"title":"Day 1"},{"generic":{"eventStartsAt":"2020-06-20T16:00:00Z","eventEndsAt":"2020-06-20T22:00:00Z"},"track1":{"id":9827,"title":"Track 1","talks":[{"id":"205728","title":"Day 2 - Keynote","description":"TBA","startsAt":"2020-06-20T16:00:00Z","endsAt":"2020-06-20T17:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":60,"speakers":[{"fullName":"TBA TBA","bio":"TBA","tagLine":"TBA","profilePicture":"https://sessionize.com/image?f=3b71e433b680ee6618cf8c2ec83026a5,400,400,1,0,2a-4204-42f0-9ba8-d7b9c6f67226.585b3f19-716e-4619-b6b1-115646049a6f.png","twitter":null,"id":"2f00c7b5-1f29-4220-94d9-4d7c499899e2"}],"multipleSpeakers":false},{"id":"205729","title":"Day 2 - Townhall","description":"TBA","startsAt":"2020-06-20T17:00:00Z","endsAt":"2020-06-20T18:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":60,"speakers":[{"fullName":"TBA TBA","bio":"TBA","tagLine":"TBA","profilePicture":"https://sessionize.com/image?f=3b71e433b680ee6618cf8c2ec83026a5,400,400,1,0,2a-4204-42f0-9ba8-d7b9c6f67226.585b3f19-716e-4619-b6b1-115646049a6f.png","twitter":null,"id":"2f00c7b5-1f29-4220-94d9-4d7c499899e2"}],"multipleSpeakers":false},{"id":"205468","title":"Innovating on OUR STEM Education","description":"What is an IQ? Why do we take the SATs? How did it end up even being a metric of childhood success? Senior Software Engineer walks through 100 years of modern education and how it has been systematically flawed for underrepresented communities. NSBE Jr. Bay Area takes on this challenge by innovating outside of the parameters of the education system.<br/>","startsAt":"2020-06-20T18:00:00Z","endsAt":"2020-06-20T18:30:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Nate Rose","bio":"Nate Rose is a Senior Software Engineer with a background in DevOps, Data Engineering, and Distributed Cloud Infrastructure Systems. Outside of engineering at Ripple, he does research in neurotechnology, casually overfits ML models and works with building education equity through non-profits like AI4ALL and NSBE.","tagLine":"Senior Software Engineer at Ripple","profilePicture":"https://sessionize.com/image?f=78e72ad517b719b3208c91561f3b0589,400,400,1,0,ac-63a4-463a-8fcb-18114d633994.f4367619-2e8c-4487-b76c-7e2d4aeb9ff0.jpg","twitter":"https://twitter.com/naterose2","id":"bb1610ac-63a4-463a-8fcb-18114d633994"}],"multipleSpeakers":false},{"id":"205531","title":"What does culturally responsive teaching mean in an online environment?","description":"Our session will discuss the importance of culturally responsive teaching and the opportunities to amplify the voices of underrepresented youth while teaching in an online environment. <br/>","startsAt":"2020-06-20T18:30:00Z","endsAt":"2020-06-20T19:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Dr. Tressa Matthews","bio":"Dr. Tressa Matthews has been teaching math to middle and high school students for 18 years.  She has a Bachelor's in Industrial and Operations Engineering from the University of Michigan.  After two years in corporate America, she decided to pursue her passion for secondary mathematics.  After earning a Masters and Doctorate in Education, Dr. Matthews co-founded Clever Math to provide online educational services for students and parents.  She has a passion for building supportive classroom environments for African-American students which became the basis for her doctoral research.","tagLine":"Clever Math LLC , Co-Founder","profilePicture":"https://sessionize.com/image?f=da2755bf9e39b6f3db30752fb209d19b,400,400,1,0,4d-9226-4deb-b654-876bbb89d832.244654b5-858d-451b-8f43-2c2c1dbb4562.jpeg","twitter":null,"id":"e0bf324d-9226-4deb-b654-876bbb89d832"},{"fullName":"Dr.  Jennifer Banks","bio":"Jennifer D. Banks, Ph.D. is currently the Mathematics and Science Coordinator for Washtenaw County.  For nearly 20 years, Dr. Banks has served as a teacher and instructional leader at various levels.  Jennifer is passionate about empowering educators and learners, to ensure that all students have equitable access and opportunities to learn and engage in high-quality rigorous mathematics.  Over the past ten years, she has intently worked to expand K-12 educators' understanding of culturally responsive instruction, specifically in the area of mathematics.  Dr. Banks holds a bachelors' Industrial and Operations Engineer and worked in the corporate sector for 4 years.  She has been recognized by various community organizations for her work in expanding access to STEM education, including the Rhonda Walker Foundation and DAPCEP.  She currently serves on the Michigan Early Mathematics Taskforce and is a lecturer for the University of Michigan. Furthermore, she is the Co-Founder of Clever Math, LLC.<br/>","tagLine":"Clever Math, LLC Co-Founder","profilePicture":"https://sessionize.com/image?f=41284bb23c90c0c48853ad5d3a80dc55,400,400,1,0,a499879c-aca4-4752-8910-14b3790846e2.jpg","twitter":null,"id":"e21dc742-0832-4c9f-aeb6-9a1e6e0f8e99"}],"multipleSpeakers":true},{"id":"208d25cf-066c-47e5-acef-d20db43d25d6","title":"Break","description":"Generated break","startsAt":"2020-06-20T19:00:00Z","endsAt":"2020-06-20T20:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":true,"duration":60,"speakers":[],"multipleSpeakers":false},{"id":"205624","title":"Autism: from bullying to volunteer and Microsoft MVP","description":"As a child I was bullied a lot. Not everyone accepted me and my autism. I got bullied at school and at work. Due to other adults were bullying me at work and the fact that I am not stress resistant I became sick and had to quit my job. I switched tires and start to investigate how can I use my programming knowledge as a volunteer. Right now I am a Microsoft MVP without a paid job. It’s a talk about how my autism challenged me but most of all how that I anticipated on the challenges and work me up to a world – wide conference speaker and even a Microsoft MVP Developer Technologies since August 1st. ","startsAt":"2020-06-20T20:00:00Z","endsAt":"2020-06-20T20:20:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":20,"speakers":[{"fullName":"Dennie Declercq","bio":"Dennie is Microsoft MVP Developer Technologies and has experience in accessibility in with Microsoft technologies. In daily life Dennie is president and developer at DDSoft, a nonprofit in function of People With Disabilities. Dennie invented technical solutions and systems to help people with disabilities to participate in their daily life. Thanks to his autism he's the right man at the right spot to contribute as a volunteer in function of people with disabilities.","tagLine":"Microsoft MVP || Developer & President DDSoft","profilePicture":"https://sessionize.com/image?f=48c13f3e030fec6503607ec7f6605292,400,400,1,0,8bfc401c-4f95-4a05-b08c-181809cb681f.jpg","twitter":"https://twitter.com/DennieDeclercq","id":"67a075a3-a111-4116-bd44-a25a01485959"}],"multipleSpeakers":false},{"id":"205367","title":"Evolving Application Monitoring with the 4 Golden Signals","description":"Traditional monitoring has relied for long time on things like alerting logged exceptions, but this often doesn't tell the whole story. It can lead to many false positives - people getting paged for things that are not customer-impacting issues - as well as false negatives where customer-impacting issues don't result in notifications.<br/><br/>I'll talk about how the 4 Golden Signals can help you raise more actionable alerts, and how this can help drive a tech organization to a more SRE-friendly culture.","startsAt":"2020-06-20T20:20:00Z","endsAt":"2020-06-20T20:40:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":20,"speakers":[{"fullName":"Val Akkapeddi","bio":"I am a engineer and a technical leader that builds great scalable, resilient software and empowered, creative teams. I believe the best outcomes are unlocked when you combine technical insight with a compassionate, nurturing attitude that allows both software and people to excel.<br/><br/>I also believe that if you have a platform, it is your responsibility to use it in the service of justice.","tagLine":"Engineering Team Lead + Observability Geek","profilePicture":"https://sessionize.com/image?f=2a80da9ed6c9eeb7a2c97e224384b991,400,400,1,0,2a-4204-42f0-9ba8-d7b9c6f67226.c3e59364-2710-4f20-abfb-c09919039040.png","twitter":null,"id":"3f1cb337-66f9-41b6-9e0d-ed1305c34ccb"}],"multipleSpeakers":false},{"id":"205540","title":"Through Programming I became a better Artist","description":"Code is my new favorite artistic medium. Creating art was once the only activity that put me in a flow state that was until I started coding. Programming like art is full of processes, speed bumps, errors, eustress, and joy. My skills as an artist have proven to be an asset in programming. While programming has cultivated artistic improvements. ","startsAt":"2020-06-20T20:40:00Z","endsAt":"2020-06-20T21:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":20,"speakers":[{"fullName":"Shukri Abdullahi N/A","bio":"Shukri Abdullahi is a Self-Taught Programmer and Multi-disciplinary Artist based in New York. ","tagLine":"Programming is an Art Form!","profilePicture":"https://sessionize.com/image?f=c7efcf99eb68d8a56e6d8f59a451657d,400,400,1,0,45ce3c06-8da0-492d-a3d5-bc7baa743be6.jpg","twitter":null,"id":"553cb856-dc47-4bd5-ac1f-234a4f1c1a45"}],"multipleSpeakers":false},{"id":"205545","title":"Session on Intellectual Property rights","description":"My sessions will tackle IP rights of black people in tech.","startsAt":"2020-06-20T21:00:00Z","endsAt":"2020-06-20T21:30:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Mark Okhakumhe","bio":"I am actively building a career in tech & innovation, corporate practice, intellectual property, dispute resolution, and impact investment. Recently, I was a judge at the regional rounds of the Philip Jessup International Law Moot Competition.<br/><br/>I enjoy speaking to people on emerging areas of law, Impact Investment, branding and personal development, startups, and Sustainable Development Goals (SDG), especially SDGs 1, 4, 7, 11 and 16. I am currently working on a podcast called \"Pinstriped\" where I talk about all the above listed.<br/><br/>As a humanitarian, I volunteered to lecture at one of Nigeria's correctional facilities. It was humbling to be part of the story of these inmates who strove to leave the facility better than when they came in. I also volunteered with the Legal Aid Council of Nigeria to take on pro bono cases, and DEVATOP to tackle human trafficking.<br/><br/>I am open to all types of engagements including speaking, volunteer, and full or part-time career opportunities. ","tagLine":"Associat","profilePicture":"https://sessionize.com/image?f=9c6d2b98309fa97d3d572b4ba93d83c1,400,400,1,0,039aad87-041e-4690-8d3e-cfa0ce97662d.jpg","twitter":null,"id":"1db166c2-48fe-4bcb-9990-a76f6f5308ba"}],"multipleSpeakers":false},{"id":"205462","title":"Grimoire: A Data Centric Blogging Platform","description":"In this talk, I will describe how I built a new blogging platform focused on creating interactive data stories. By the end, you will understand the tools and techniques used to build a serverless first platform and a new place to communicate with data.  ","startsAt":"2020-06-20T21:30:00Z","endsAt":"2020-06-20T22:00:00Z","roomId":"14062","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Banjo Obayomi","bio":"Banjo is a Senior Research Engineer at Two Six Labs, where he develops platform solutions for productizing various researched-based projects. Banjo is passionate about operationalizing data aka DataOps and has started a podcast and meetup around data.","tagLine":"DataOps Mindset, Full Stack Background, Can't Lose","profilePicture":"https://sessionize.com/image?f=37ed47d9e5ff657e4a56fb01f42f5956,400,400,1,0,9e-603f-4ed6-965b-9dad8885ccc9.97ff5546-0362-4bf0-9c7f-61820e52cd31.png","twitter":null,"id":"7b8e269e-603f-4ed6-965b-9dad8885ccc9"}],"multipleSpeakers":false}]},"track2":{"id":9600,"title":"Track 2","talks":[{"id":"b45e15b1-c652-4376-85ca-a5cfb45b73ad","title":"Break","description":"Generated break","startsAt":"2020-06-20T16:00:00Z","endsAt":"2020-06-20T18:00:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":true,"duration":120,"speakers":[],"multipleSpeakers":false},{"id":"205473","title":"The future of tech and how to keep in touch while it evolves","description":"It is a fact that technology can be overwhelming when one decides to start his journey. Several people spend years before they can find the right career they fit in to. In this session, we will address how people who find their self in this category can progress while staying up to date with all new technologies. We will briefly mention technologies which are must know and also discuss some resources that people developers can leverage own to upskill.<br/><br/>","startsAt":"2020-06-20T18:00:00Z","endsAt":"2020-06-20T19:00:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":false,"duration":60,"speakers":[{"fullName":"Dawood Iddris","bio":"Dawoodiddris is a software developer, passionately creating products and changing lives with his soft and technical skills by training others in event, workshops and providing platforms for coders to think beyond the limit.","tagLine":"Software & co founder Techloud Inc, Backend Developer  Effect Studios, Microsoft Student Partner ","profilePicture":"https://sessionize.com/image?f=e635a646e1ade36f95027f0e25086b55,400,400,1,0,d6-efce-495f-9cde-97ddcaa425f4.b69d0ee7-1d20-49b2-bfa1-ab8f92a40786.jpg","twitter":null,"id":"7d0172d6-efce-495f-9cde-97ddcaa425f4"}],"multipleSpeakers":false},{"id":"dd18027c-8c69-4798-8f77-810c14921eb2","title":"Break","description":"Generated break","startsAt":"2020-06-20T19:00:00Z","endsAt":"2020-06-20T20:00:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":true,"duration":60,"speakers":[],"multipleSpeakers":false},{"id":"205359","title":"So You Want to Be a Founder?","description":"Learn from my own journey of personal growth as I left Microsoft to co-found a company.  We'll discuss the hardships you can face, how to overcome any struggles, and reflect back on some lessons learned so that you will have a smoother time than I did.","startsAt":"2020-06-20T20:00:00Z","endsAt":"2020-06-20T20:30:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Claudius Mbemba","bio":"Claudius Mbemba was born in Cameroon, Africa to hard-working blue-collar parents who taught him the value of hard work, being a self-starter, and always learning. Immigrating to the US at the age of 7, Claudius saw how technology vastly improved the lives of Americans. It was then his love for technology was born. Following high school, Claudius pursued his Bachelors Degree in Computer Science while on the Varsity Football team at The Ohio State University. Upon completing his degree he accepted employment at Microsoft in Seattle, WA where he worked as a Software Engineer, largely focusing his time on Voice, Mobile, Cloud, Bots, DevOps, ML/AI, & Blockchain. Claudius is currently CTO of Neu Inc, a startup building a marketplace that provides automated hotel-grade turnovers for Airbnb/vacation rentals.<br/><br/>Learn more about Claudius on his website: www.claudiusmbemba.com","tagLine":"CTO @ neu","profilePicture":"https://sessionize.com/image?f=e947ce8b40dbc8bbed9eab6d7f5e3f82,400,400,1,0,4c-07ea-4356-b5b3-29fee8d4b842.a2abfab7-6525-468c-8042-d4df310fab0e.jpg","twitter":"https://twitter.com/mbembaships","id":"ddfecb4c-07ea-4356-b5b3-29fee8d4b842"}],"multipleSpeakers":false},{"id":"205471","title":"For Us, Without Us: Addressing Tech’s Shortcomings in Creating Equity for Black People","description":"Many consider technology to be the “great equalizer”, but it’s evident that Black people are not benefiting at the same rates as others. This session will discuss how the forces that limit Black people’s ability to navigate the physical also prevent us from exerting agency via the digital. Together, we’ll discuss the ways that anti-Blackness is replicated in technology, the discrepancies faced by Black communities due to the digital divide, and the changes required for us to have a more equitable future. Because we can never fully benefit if technology continues to be made for us, without us. ","startsAt":"2020-06-20T20:30:00Z","endsAt":"2020-06-20T21:00:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Jacqueline Gibson","bio":"Jacqueline is a Digital Equity Advocate & Software Engineer building change from the code up. She's interested in leveraging technology for social good, particularly identifying ways in which current technology maintains social inequities and working to eliminate these biases. She strives to understand what is necessary to create systems that everyone, regardless of ability, can use with ease.<br/><br/>She graduated with dual degrees in Computer Science and African & African Diaspora Studies from the University of Texas at Austin. She's currently developing tools to create accessible applications for Android, Windows, and web as part of Microsoft's Accessibility Insights team. ","tagLine":"Software Engineer focusing on accessibility at Microsoft","profilePicture":"https://sessionize.com/image?f=baddd8204e89ae7a6d6e97fd2a9fcdbd,400,400,1,0,c7-3ab5-4aef-9d55-3fee6cd0b065.c97d33e6-c1f4-44dd-8f7d-dfcfee0fc6dd.jpg","twitter":null,"id":"1be155c7-3ab5-4aef-9d55-3fee6cd0b065"}],"multipleSpeakers":false},{"id":"205478","title":"Blackfacts and The Wakanda Technology Platform - Technology By Us/For Us/About Us","description":"Learn about and see demonstrations of cutting edge technologies created to preserve, protect and syndicate historical and current information about the achievements and struggles of Black people, created by a Black software developer who, since the 90s has built systems that put hundreds of businesses, several communities and an entire Caribbean nation online, as well as the Internet's first Black History Encyclopedia, continuously running since 1997.","startsAt":"2020-06-20T21:00:00Z","endsAt":"2020-06-20T21:30:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Ken Granderson","bio":"Ken is a Digital Visionary and Pioneer who launched Blackfacts.com (the Internet's first Black History Encyclopedia) in 1997, put his former community of Roxbury online in 2002, and created the web site for the Caribbean island nation of Saint Lucia in 2013.<br/><br/>His 25-year commitment to build cutting-edge technologies to benefit communities of color has resulted in him building online systems decades ahead of their time, and today the platform he architected for Blackfacts, called the Wakanda Technology Platform, is positioned to become a leading provider of Global Black News and other services, and the only  such platform created by a Black person.<br/><br/>Ken's Digital Archive of news stories, videos and presentations is at http://kengranderson.com","tagLine":"Digital Visionary, Pioneer and Entrepreneur","profilePicture":"https://sessionize.com/image?f=7c96c02fd2fe2c9f1376ba08cfd524c1,400,400,1,0,8f-f092-4da4-bd7c-34b9f15e21bb.5b6a0d79-d75f-4889-b8f1-25b46d55c39f.jpg","twitter":null,"id":"a1c12f8f-f092-4da4-bd7c-34b9f15e21bb"},{"fullName":"Dale Dowdie","bio":"Dale Dowdie founded Intellitech Consulting Enterprises in 1993, the 3rd company he had started since his first company started while still in college. The goal of Intellitech is to provide intelligent technology solutions for business and educational institutions. Over the past 20 years, Intellitech has provided Software Development, Management/IT Consulting, Disaster Recovery/Business Continuity and Consulting Services for organizations, banks and institutions including Liberty Mutual Insurance, Citizens Bank, TJX Companies, Staples and McCormick, to the Government of St. Lucia and Harvard University.<br/><br/>The company has weathered many storms and adjusted its services to meet the ever changing technology demands of the industry. Intellitech continues to grow its customer base in a market that demands effective computing via local/wide-area networking, custom software development database customization, Internet/Intranet services, and systems integration services.<br/><br/>Mr. Dowdie studied computer engineering at Boston University, with a successful track record working for organizations such as the Goddard Space Flight Center(NASA), Lotus Development Corporation, Wang, IBM, and MCI. Over time, that client base evolved to including major banks (Bank of Boston, USTrust, Citizens Bank), Insurance Companies (Liberty Mutual), Healthcare (University Hospitals of Cleveland, Hoffman LaRoche), Biotech (Genzyme) and Retail (Staples, TJ Maxx Companies) organizations. Intellitech has also developed a core vertical market software development team that designs industry specific web/mobile enabled solutions.<br/><br/>One such solution is BARBinc.com. This idea started in 2009 when Mr. Dowdie was frustrated with having to wait when he arrived at his barber for his scheduled appointment. It seemed that his barber had no tools for tracking or managing appointments, nor did he have a web presence. Given Mr. Dowdie’s background, he thought that maybe there was a way that technology could be used to address these issues. However, nothing really progressed with this kernel of an idea until 2011, when Mr Dowdie decided to make the idea a reality.<br/><br/>BARBinc.com was implemented as a Service (created and powered by Intellitech) which would provide Technology solutions for the Hair and Beauty Industry. In the space of a few years, BARBinc.com went from a simple idea to the #1 source of Barbering News and Information on the internet. In 2014, the BARBinc Newswire Service had a following of 19 people and a social media reach of less than 100. By 2017, it had over 50,000 followers and social media reach of over 30 Million. The industry specific services include online and mobile scheduling and shop management, a national directory of barbers/shops/salons/schools, a marketplace to buy and sell industy products, a mobile portal for news, information and event management with more services coming soon. BARBinc.com has customers from the National Association of Barber Boards of America to Bronner Brothers International Hair Show. BARBinc Educators include some of the top Trainers and Educators in the Industry. BARBinc Total Event solutions have been utilized to sell tickets and manage events for some of the biggest hair shows and barber battles in the industry.<br/><br/>Another Solution is BlackFacts.com. Blackfacts is the brain-child of longtime friend and collaborator Ken Granderson, and over the past 20 years it has been running and providing historical facts-of-the-day to our community. Mr. Dowdie was brought in early on to help husband the idea to the next level. However, for years the site remained just a source of black history facts, and in time it grew to be the #1 source for Black Facts on the internet. That all changed in 2017, as Mr. Dowdie and Mr. Granderson finally gave the project the focus it deserved and thus began the process of turning Blackfacts.com from just a historical reference site for Black History into the 'Black Wikipedia' and a showcase of the cultural contributions of people of color and a showcase of the type of technology solutions that can be provided by and to people of color. Those efforts can be seen in this, the latest evolution of BlackFacts.com. There is so much that can be done with the platform, and we hope that you stick around to enjoy the journey with us...<br/><br/>“We are here to alleviate any issue the client is having with new technology, whether that be training, web site development, or networking,” says Mr. Dowdie, who takes pride in understanding the delicate balance of working with people and technology. “Technology may be our future, but people are making the decisions on how it will best benefit their business needs. Our primary focus is to bridge the gap between technology advancement and realistic solutions for companies.”<br/><br/>As a leading edge business based in Boston, MA, Intellitech has a diverse staff of team members with the background and expertise to satisfy clients from around the world. “Human connection is not lost in the Internet, it is only expanded. Our solutions always keep that fact in mind and in the forefront of the minds of our customers.”<br/><br/>Intellitech Website: www.intellitech.net<br/>BARBinc.com Website: www.barbinc.com<br/>BARBinc.com Newswire: news.barbinc.com<br/>Black Facts Website: www.blackfacts.com","tagLine":"Co-Founder/CEO","profilePicture":"https://sessionize.com/image?f=285981226dbb94ee8bec52d4795709d9,400,400,1,0,35f3d344-2391-49cd-8e76-ea63536f774f.jpg","twitter":null,"id":"1c5f2590-bbb4-475f-8b3e-ef5dcf0590bf"}],"multipleSpeakers":true},{"id":"205365","title":"Why You're Not Landing That UX Role","description":"As a UX Coach, the question I am asked the most is \"How do I actually land that UX role?\". While the question is broad, I've identified a few areas where aspiring UX Designers really struggle getting their foot in the door at companies of their choice. In my talk, attendees will walk away being able to not only identify their key problem areas, but have action items around overcoming those obstacles to land their dream role. ","startsAt":"2020-06-20T21:30:00Z","endsAt":"2020-06-20T22:00:00Z","roomId":"14063","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Ashley Janelle","bio":"<br/>As a seasoned User Experience and User Interface Designer, Ashley Janelle focuses on designing customer centered experiences that target her users everyday challenges. At Caterpillar Inc., Ashley taps into user needs while designing solutions that allow them to save time, money, and increase their productivity. <br/><br/>As a UX coach and course creator, she’s developed an online course, “Learn UX Online in 16 Weeks” to help aspiring UX designers go from beginner to experienced UX Designers to land jobs at top companies. Using her UX expertise and passion for working with people, Ashley’s not only helped others land their dream roles, but build the confidence to become successful UX Designers. ","tagLine":"UX/UI Designer & UX Coach","profilePicture":"https://sessionize.com/image?f=f4492dfa93616943dd5be87da9af2841,400,400,1,0,687ae03f-126e-48ef-be9b-9116c2016941.jpg","twitter":null,"id":"a3e0e5a9-3980-4234-9fa2-fca935b3ba9f"}],"multipleSpeakers":false}]},"track3":{"id":4927,"title":"Track 3","talks":[{"id":"bf7dca62-20b9-495e-b21d-3c2679581707","title":"Break","description":"Generated break","startsAt":"2020-06-20T16:00:00Z","endsAt":"2020-06-20T18:00:00Z","roomId":"14064","language":null,"youtube":null,"isBreak":true,"duration":120,"speakers":[],"multipleSpeakers":false},{"id":"205495","title":"Build JavaScript applications with accessibility in mind","description":"Accessibility is a very important aspect of web development and the goal of this talk is to spread awareness about accessibility and motivate the developers to code with inclusion, diversity, and empathy in mind. This will include practical examples of inaccessible code and how to fix those.<br/><br/>The main topics for discussion will be as follows:<br/><br/>1. A brief introduction of a11y<br/><br/>2. Importance of accessibility<br/><br/>3. Demos and code examples exploring the ways in which JavaScript code can make or break the website accessibility. This will include how to make the functionalities accessible to keyboard users and users of assistive technology.<br/><br/>4. Tools and extensions which can help to write and test accessible applications and websites<br/><br/>The Key takeaways - the audience can apply the concepts learned within their projects/frameworks allowing everyone to write fully accessible and interactive interfaces/websites.","startsAt":"2020-06-20T18:00:00Z","endsAt":"2020-06-20T19:00:00Z","roomId":"14064","language":null,"youtube":null,"isBreak":false,"duration":60,"speakers":[{"fullName":"Anuradha Kumari","bio":"Anuradha is a Tech enthusiast and JavaScript evangelist working as Development Specialist at Mediaocean. She is passionate about exploring new technologies and sharing knowledge through tech articles and talks. She has given local as well as international talks on accessibility. She aims to spread awareness and empower the community towards achieving the common goal of inclusion through technology.","tagLine":"Tech enthusiast and JavaScript evangelist working as Development Specialist at Mediaocean","profilePicture":"https://sessionize.com/image?f=29fd4b553bdef2397f6f520e1aa8d278,400,400,1,0,dc-5176-4117-b441-716cc1d3dce0.1f440560-b5da-49e4-a213-b08488fa4441.jpg","twitter":"https://twitter.com/miracle_404","id":"b33499dc-5176-4117-b441-716cc1d3dce0"}],"multipleSpeakers":false},{"id":"03e81008-01c1-4d0f-b219-c43577916fb7","title":"Break","description":"Generated break","startsAt":"2020-06-20T19:00:00Z","endsAt":"2020-06-20T20:00:00Z","roomId":"14064","language":null,"youtube":null,"isBreak":true,"duration":60,"speakers":[],"multipleSpeakers":false},{"id":"205541","title":"Keeping pace with what's new in Java 14 and 15","description":"A live coding session that covers new or modified language features in Java 14 and 15 - with a lot of hands-on examples. <br/><br/>Features covered: Sealed Classes and Interfaces, Records, Pattern Matching for instanceof, Text Blocks and Switch Expressions. <br/>","startsAt":"2020-06-20T20:00:00Z","endsAt":"2020-06-20T21:00:00Z","roomId":"14064","language":null,"youtube":null,"isBreak":false,"duration":60,"speakers":[{"fullName":"Mala Gupta","bio":"Mala Gupta is a Developer Advocate at JetBrains. She is also the founder and lead mentor at eJavaGuru.com, Java Champion at Oracle, book author with Manning, Packt, and O'Reilly Publications. <br/><br/>An international speaker at industry conferences, she has experience of 19 years in the software industry. She has been actively supporting Java certification as a path to career advancement. Since 2006, she has been coaching students and professionals to succeed in these certifications. Mala Gupta’s Java books with Manning Publications, USA, are top-rated for Java Certification around the globe. <br/><br/>She co-leads Delhi Java User Group. A strong supporter of Women in Technology, she drives initiatives of Women Who Code - Delhi chapter to augment the participation of women in tech.","tagLine":"Developer Advocate, JetBrains. Author, Speaker. Java Champion.","profilePicture":"https://sessionize.com/image?f=1a454b78844c047fb6ba21e4b46fea4d,400,400,1,0,46272ec8-ed6b-4833-bd76-18bd529bafac.jpg","twitter":null,"id":"16e1da1a-8902-415a-badf-f021d7b888ec"}],"multipleSpeakers":false},{"id":"205380","title":"Creating Test Stability To Achieve Continuous Delivery","description":"Our agile teams struggled to continuously merge local code changes to the master repository. In our company, our automated test were taking 30 minutes of execution time and the occurrence of flaky tests was just multiplying this time and reducing the confidence in the results. This slowed our agile teams down tremendously to the point where they couldn’t deliver continuously with automated pipelines. Ensuring high quality for each iteration became a challenge for our agile teams as they had to wait for my analysis of the failing tests. We had created automated checks to make our testing more efficient, but instead they were slowing us down and causing bottlenecks - I was a bottleneck.<br/><br/>Our automated tests were maintained by various team members and some of them were not following leading practices - which led to flaky results due to such things as - concurrency relying on non-deterministic behaviour, caching, dynamic content and many other factors. I needed to find out the root causes. I started my investigation and found the common issues were because of environment, locators, coding practices and a lack of knowledge sharing and code reviews. I improved our locators, coding practices, debugging and simultaneously the developers helped us to fix all environment issue and slow page load times, it was a long journey but it was definitely worth it.<br/><br/>Currently our automated test suites takes just 5 minutes to run in our CI environment - a huge improvement! Now my team members are more encouraged to see why a test is failing because the majority of failures now are genuine, and are providing valuable information. As a team, we get to spend more time testing and creating new automated tests, which has resulted in finding more bugs. We’ve also put things in places to avoid ending up in a flaky nightmare again, such as a Wiki Page of leading practices.I’m no longer a bottleneck, the team works together to maintain fast valuable automated tests, and I want to share the insights from that journey with you.<br/><br/>After this session, you’ll learn techniques to: 1. Treat test code as production code and test environments as production environments 2. Improve the stability of your tests which in turn improves your continuous delivery pipeline 3. Make tests faster to enable fast feedback","startsAt":"2020-06-20T21:00:00Z","endsAt":"2020-06-20T21:30:00Z","roomId":"14064","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Trisha Chetani","bio":"I am an automation enthusiast. I have seven years of experience in the software testing space. I have enjoyed being a software tester, helping the team to follow testing processes and support that enable teams to deliver high-quality software in DevOps Environment. I have worked on manual & automation (Front-End & Rest APIs). I'm always enthusiastic to attend Conference meetups for professional development.","tagLine":"Software Tester","profilePicture":"https://sessionize.com/image?f=907bbf86058be9ed7c15c571f0f3af35,400,400,1,0,b3-f922-4b4e-8bc5-ed133b247e9d.344ff1a2-c12a-4cae-94ed-6bbe07e8176f.jpg","twitter":"https://twitter.com/trisha_1212","id":"635bf7b3-f922-4b4e-8bc5-ed133b247e9d"}],"multipleSpeakers":false},{"id":"205422","title":"The Technology and Psychology of Refactoring","description":"When the requirements change out from under your tech team, your code has to change. So it’s worthwhile to build your skills in assessing code maintainability, deciding whether to refactor, and doing the refactor.<br/><br/>In this talk, we’ll answer questions like:<br/><br/>What does it mean for code to be maintainable, and how do we make code more maintainable?<br/>How do we know when to refactor—and how do we know when to stop refactoring?<br/>How do we sell stakeholders on giving us space to make a large refactor?<br/>This talk includes both code samples and architecture samples from apps in use today.","startsAt":"2020-06-20T21:30:00Z","endsAt":"2020-06-20T22:00:00Z","roomId":"14064","language":null,"youtube":null,"isBreak":false,"duration":30,"speakers":[{"fullName":"Chelsea Troy","bio":"Chelsea writes code on projects like the Zooniverse Citizen Science Mobile App and the NASA Landsat Image Processing Pipeline. She looks for clients who are saving the planet, advancing basic scientific research, or providing resources to underserved communities. She has been known to take projects in mobile development, web development, and machine learning. She streams some programming sessions to YouTube, so you can watch her code (and narrate!) in real time. She then turns the recordings into educational materials.<br/><br/>Chelsea also teaches Mobile Software Development at the Master’s Program in Computer Science at the University of Chicago. She is the author of chelseatroy.com and a book called Remote Work Sucks (the title is kind of a trap). She organizes two conferences: PromptConf (Chicago area, very technical) and ORD Camp (Chicago area, not nearly as technical).<br/><br/>Chelsea flings barbells around for fun. She drives an electric cafe cruiser named Gigi. She's very gay.<br/><br/>*Note on speaker photo: I'm not sure mine uploaded correctly but it is available at the bottom of chelseatroy.com/speaking, feel free to steal it from there :)","tagLine":"I write code for money, fling barbells for fun, and write about tech for jack diddly at chelseatroy.com.","profilePicture":"https://sessionize.com/image?f=b92dace81787511359bc063f29597e77,400,400,1,0,cf-8bc4-4aca-8181-dbd4a2aeac90.62b31710-14e5-4cfb-9dce-6ceb5676d6a1.jpg","twitter":null,"id":"e3d878cf-8bc4-4aca-8181-dbd4a2aeac90"}],"multipleSpeakers":false}]},"track4":{"id":0,"title":null,"talks":[]},"sessions":null,"id":4294,"title":"Day 2"}]}